[
  {"ans":"o4","qid":"cepyq1","tag":"AIPMT 2006","fig":"database/figures/current-electricity/cepyq1.jpeg", "question": "In the circuit shown, if a conducting wire is connected between points A and B, the current in this wire will :-", "o1": "flow from A to B", "o2": "flow in the direction which will be decided by the value of V", "o3": "be zero", "o4": "flow from B to A" },
  {"ans":"o3","qid":"cepyq2","tag":"AIPMT 2007","fig":null, "question": "The resistance of an ammeter is 13 Ω and its scale is graduated for currents up to 100 A. After an additional shunt is connected to this ammeter it becomes possible to measure currents up to 750 amperes by this meter. The value of shunt resistance is :-", "o1": "2 kΩ", "o2": "20 Ω", "o3": "2 Ω", "o4": "0.2 Ω" },
  {"ans":"o2","qid":"cepyq3","tag":"AIPMT 2008","fig":"database/figures/current-electricity/cepyq3.jpeg", "question": "In the circuit shown, the current through the 4 Ω resistor is 1 A when the points P and M are connected to a d.c. voltage source. The potential difference between the points M and N is :-", "o1": "0.5 volts", "o2": "3.2 volts", "o3": "1.5 volts", "o4": "1.0 volt" },
  {"ans":"o2","qid":"cepyq4","tag":"AIPMT 2008","fig":null, "question": "A galvanometer of resistance 50 Ω is connected to a battery of 3 V along with a resistance of 2950 Ω in series. A full scale deflection of 30 divisions is obtained in the galvanometer. In order to reduce this deflection to 20 divisions, the resistance in series should be :-", "o1": "6050 Ω", "o2": "4450 Ω", "o3": "5050 Ω", "o4": "5550 Ω" },
  {"ans":"o2","qid":"cepyq5","tag":"AIPMT 2008","fig":"database/figures/current-electricity/cepyq5.jpeg", "question": "A current of 3 amperes flows through the 2 Ω resistor shown in the circuit. The power dissipated in the 5 Ω resistor is :-", "o1": "1 watt", "o2": "5 watts", "o3": "4 watts", "o4": "2 watts" },
  {"ans":"o2","qid":"cepyq6","tag":"AIPMT 2009","fig":"database/figures/current-electricity/cepyq6.jpeg", "question": "A wire of resistance 12 ohms per meter is bent to form a complete circle of radius 10 cm. The resistance between its two diametrically opposite points, A and B as shown in the figure, is :-", "o1": "6 Ω", "o2": "0.6π Ω", "o3": "3 Ω", "o4": "6π Ω" },
  {"ans":"o2","qid":"cepyq7","tag":"AIPMT 2009","fig":"database/figures/current-electricity/cepyq7.jpeg", "question": "See the electrical circuit shown in this figure. Which of the following equations is the correct equation for it ?", "o1": "ε1 – (i1 + i2 )R + i1 r1 = 0", "o2": "ε1 – (i1 + i2 )R - i1 r1 = 0", "o3": "ε2 - i2 r2 - ε1 - i1 r1 = 0", "o4": "-ε2 - (i1 + i2 )R + i2 r2 = 0" },
  {"ans":"o1","qid":"cepyq8","tag":"AIPMT 2009","fig":null, "question": "A galvanometer having a coil resistance of 60 Ω shows full scale deflection when a current of 1.0 A passes through it. It can be converted into an ammeter to read currents up to 5.0 A by :-", "o1": "putting in parallel a resistance of 15 Ω", "o2": "putting in parallel a resistance of 240 Ω", "o3": "putting in series a resistance of 15 Ω", "o4": "putting in series a resistance of 240 Ω" },
  {"ans":"o3","qid":"cepyq9","tag":"AIPMT 2009","fig":null, "question": "A student measures the terminal potential difference (V) of a cell (of emf ε and internal resistance r) as a function of the current (I) flowing through it. The slope and intercept of the graph between V and I, then respectively, are :-", "o1": "–ε and r", "o2": "-r and ε", "o3": "ε and -r", "o4": "r and –ε" },
  {"ans":"o3","qid":"cepyq10","tag":"AIPMT 2010","fig":"database/figures/current-electricity/cepyq10.png", "question": "A potentiometer circuit is set up as shown. The potential gradient, across the potentiometer wire, is k volts/cm and the ammeter, present in the circuit, reads 1.0 A when two way key is switched off. The balance points, when the key between the terminals (i) 1 and 2 (ii) 1 and 3, is plugged in, are found to be at lengths 1 cm and 2 cm respectively. The magnitudes, of the resistors R and X, (in ohms), are then, equal to respectively :-", "o1": "k1 and k2", "o2": "k1 and k(2 – 1)", "o3": "k(2 – 1) and k2", "o4": "k(2 – 1) and k1" },
  {"ans":"o2","qid":"cepyq11","tag":"AIPMT 2010","fig":null, "question": "A galvanometer has a coil of resistance 100 ohms and gives full scale deflection for 30 mA current. If it is to work as a voltmeter of 30 volt range, the resistance required to be added will be:-", "o1": "1000 Ω", "o2": "900 Ω", "o3": "1800 Ω", "o4": "500 Ω" },
  {"ans":"o1","qid":"cepyq12","tag":"AIPMT 2010","fig":null, "question": "Consider the following two statements : (A) Kirchhoff's junction law follows from the conservation of charge. (B) Kirchhoff's loop law follows from the conservation of energy. Which of the following is correct ?", "o1": "Both (A) and (B) are correct", "o2": "Both (A) and (B) are wrong", "o3": "(A) is correct and (B) is wrong", "o4": "(A) is wrong and (B) is correct" },
  {"ans":"o2","qid":"cepyq13","tag":"AIPMT 2011","fig":null, "question": "A current of 2 A flows through a 2 Ω resistor when connected across a battery. The same battery supplies a current of 0.5 A when connected across a 9 Ω resistor. The internal resistance of the battery is :-", "o1": "0.5 Ω", "o2": "1/3 Ω", "o3": "1/4 Ω", "o4": "1 Ω" },
  {"ans":"o3","qid":"cepyq14","tag":"AIPMT 2011","fig":"database/figures/current-electricity/cepyq14.png", "question": "If power dissipated in the 9 Ω resistor in the circuit shown is 36 Watt, the potential difference across the 2 Ω resistor is :-", "o1": "4 V", "o2": "8 V", "o3": "10 V", "o4": "2 V" },
  {"ans":"o1","qid":"cepyq15","tag":"AIPMT 2011","fig":"database/figures/current-electricity/cepyq15.png", "question": "In the circuit shown in the figure, if the potential at point A is taken to be zero, the potential at point B is :-", "o1": "+1 V", "o2": "-1 V", "o3": "+2 V", "o4": "-2 V" },
  {"ans":"o4","qid":"cepyq16","tag":"AIPMT 2011","fig":null, "question": "A galvanometer of resistance, G, is shunted by a resistance S. To keep the main current in the circuit unchanged, the resistance to be put in series with the arrangement is:", "o1": "G(S+G)", "o2": "2S(S+G)", "o3": "SG(S+G)", "o4": "2G(S+G)" },
  {"ans":"o2","qid":"cepyq17","tag":"AIPMT 2012","fig":"database/figures/current-electricity/cepyq17.png", "question": "A ring is made of a wire having a resistance R0 = 12 Ω. Find the points A and B at which a current carrying conductor should be connected so that the resistance R of the sub circuit between these points is equal to 8/3 Ω:", "o1": "1/2 = λ/λ", "o2": "1/2 = 1/2 = λ/λ", "o3": "1/2 = 5/8 = λ/λ", "o4": "1/2 = 1/3 = λ/λ" },
  {"ans":"o1","qid":"cepyq18","tag":"AIPMT 2012","fig":null, "question": "If voltage across a bulb rated 220 volts 100 watts drops by 2.5% of its rated value, the percentage of the rated value by which the power would decrease is:", "o1": "5%", "o2": "10%", "o3": "20%", "o4": "2.5%" },
  {"ans":"o4","qid":"cepyq19","tag":"AIPMT 2012","fig":"database/figures/current-electricity/cepyq19.png", "question": "In the circuit shown, the cells A and B have negligible resistances. For VA = 12 V, R1 = 500 Ω and R = 100 Ω, the galvanometer (G) shows no deflection. The value of VB is:", "o1": "12 V", "o2": "6 V", "o3": "4 V", "o4": "2 V" },
  {"ans":"o3","qid":"cepyq20","tag":"AIPMT 2012","fig":null, "question": "A millivoltmeter of 25 millivolts range is to be converted into an ammeter of 25 amperes range. The value (in ohms) of necessary shunt will be:", "o1": "1", "o2": "0.05", "o3": "0.001", "o4": "0.01" },
  {"ans":"o1","qid":"cepyq21","tag":"AIPMT 2012","fig":"database/figures/current-electricity/cepyq21.png", "question": "The power dissipated in the circuit shown in the figure is 30 watts. The value of R is:", "o1": "10 Ω", "o2": "30 Ω", "o3": "20 Ω", "o4": "15 Ω" },
  {"ans":"o1","qid":"cepyq22","tag":"AIPMT 2012","fig":null, "question": "A cell having an emf ε and internal resistance r is connected across a variable external resistance R. As the resistance R is increased, the plot of potential difference V across R is given by:", "o1": "εV0/R", "o2": "V0/R", "o3": "εV0/R", "o4": "εV0/R" },
  {"ans":"o1","qid":"cepyq23","tag":"NEET(UG) 2013","fig":null, "question": "A wire of resistance 4 Ω is stretched to twice its original length. The resistance of the stretched wire would be:", "o1": "16 Ω", "o2": "2 Ω", "o3": "4 Ω", "o4": "8 Ω" },
  {"ans":"o3","qid":"cepyq24","tag":"NEET(UG) 2013","fig":null, "question": "The internal resistance of a 2.1 V cell which gives a current of 0.2 A through a resistance of 10 Ω is:", "o1": "1.0 Ω", "o2": "0.2 Ω", "o3": "0.5 Ω", "o4": "0.8 Ω" },
  {"ans":"o3","qid":"cepyq25","tag":"NEET(UG) 2013","fig":null, "question": "The resistances of the four arms P, Q, R, and S in a Wheatstone bridge are 10 ohms, 30 ohms, 30 ohms, and 90 ohms, respectively. The e.m.f. and internal resistance of the cell are 7 volts and 5 ohms respectively. If the galvanometer resistance is 50 ohms, the current drawn from the cell will be:", "o1": "2.0 A", "o2": "1.0 A", "o3": "0.2 A", "o4": "0.1 A" },
  {"ans":"o2","qid":"cepyq26","tag":"AIPMT 2014","fig":null, "question": "Two cities are 150 km apart. Electric power is sent from one city to another city through copper wires. The fall of potential per km is 8 volts and the average resistance per km is 0.5 Ω. The power loss in the wires is:", "o1": "19.2 W", "o2": "19.2 kW", "o3": "19.2 J", "o4": "12.2 kW" },
  {"ans":"o2","qid":"cepyq27","tag":"AIPMT 2014","fig":"database/figures/current-electricity/cepyq27.png", "question": "The resistance in the two arms of a meter bridge are 5 Ω and R Ω, respectively. When the resistance R is shunted with an equal resistance, the new balance point is at 1.6 λ1. The resistance ‘R’ is:", "o1": "10 Ω", "o2": "15 Ω", "o3": "20 Ω", "o4": "25 Ω" },
  {"ans":"o3","qid":"cepyq28","tag":"AIPMT 2014","fig":null, "question": "A potentiometer circuit has been set up for finding the internal resistance of a given cell. The main battery, used across the potentiometer wire, has an emf of 2.0 V and a negligible internal resistance. The potentiometer wire itself is 4m long. When a resistance R, connected across the given cell, has values of (i) infinity (ii) 9.5 Ω, the balancing lengths on the potentiometer wire are found to be 3 m and 2.85 m respectively. The value of internal resistance of the cell is:", "o1": "0.25 Ω", "o2": "0.95 Ω", "o3": "0.5 Ω", "o4": "0.75 Ω" },
  {"ans":"o3","qid":"cepyq29","tag":"AIPMT 2014","fig":null, "question": "In an ammeter 0.2% of main current passes through the galvanometer. If resistance of galvanometer is G, then resistance of ammeter will be:", "o1": "1/499 G", "o2": "499/500 G", "o3": "1/500 G", "o4": "500/499 G" },
  {"ans":"o3","qid":"cepyq30","tag":"AIPMT 2015","fig":null, "question": "A potentiometer wire of length L and resistance r is connected in series with a battery of e.m.f. E0 and a resistance r1. An unknown e.m.f. E is balanced at a length λ of the potentiometer wire. The e.m.f. E will be given by:", "o1": "(E0(r1 + r)λ)/(r1 + r)", "o2": "(E0 r λ)/(r1 + r)", "o3": "(E0 r L + λ)/(r1 + r)", "o4": "(E0 L λ)" },
  {"ans":"o2","qid":"cepyq31","tag":"AIPMT 2015","fig":null, "question": "Two metal wires of identical dimensions are connected in series. If σ1 and σ2 are the conductivities of the metal wires respectively, the effective conductivity of the combination is:", "o1": "σ1 + σ2", "o2": "σ1 + σ2/σ1σ2", "o3": "σ1σ2 / (σ1 + σ2)", "o4": "σ1σ2 + σ1 + σ2" },
  {"ans":"o2","qid":"cepyq32","tag":"AIPMT 2015","fig":null, "question": "A circuit contains an ammeter, a battery of 30 V, and a resistance of 40.8 ohm all connected in series. If the ammeter has a coil of resistance 480 ohm and a shunt of 20 ohm, the reading in the ammeter will be:", "o1": "1 A", "o2": "0.5 A", "o3": "0.25 A", "o4": "2 A" },
  {"ans":"o1","qid":"cepyq33","tag":"AIPMT 2015","fig":null, "question": "Across a metallic conductor of non-uniform cross section, a constant potential difference is applied. The quantity which remains constant along the conductor is:", "o1": "current", "o2": "drift velocity", "o3": "electric field", "o4": "current density" },
  {"ans":"o4","qid":"cepyq34","tag":"AIPMT 2015","fig":null, "question": "A potentiometer wire has length 4 m and resistance 8Ω. The resistance that must be connected in series with the wire and an accumulator of e.m.f. 2V, so as to get a potential gradient 1 mV per cm on the wire is:", "o1": "40 Ω", "o2": "44 Ω", "o3": "48 Ω", "o4": "32 Ω" },
  {"ans":"o4","qid":"cepyq35","tag":"AIPMT 2015","fig":"database/figures/current-electricity/cepyq35.png", "question": "A, B and C are voltmeters of resistance R, 1.5 R and 3R respectively as shown in the figure. When some potential difference is applied between X and Y, the voltmeter readings are VA, VB and VC respectively. Then:", "o1": "VA ≠ VB = VC", "o2": "VA = VB ≠ VC", "o3": "VA ≠ VB ≠ VC", "o4": "VA = VB = VC" },
  {"ans":"o4","qid":"cepyq36","tag":"NEET(UG) 2016","fig":null, "question": "A potentiometer wire is 100 cm long and a constant potential difference is maintained across it. Two cells are connected in series first to support one another and then in opposite direction. The balance points are obtained at 50 cm and 10 cm from the positive end of the wire in the two cases. The ratio of emf's is:", "o1": "5 : 1", "o2": "5 : 4", "o3": "3 : 4", "o4": "3 : 2" },
  {"ans":"o2","qid":"cepyq37","tag":"NEET(UG) 2016","fig":"database/figures/current-electricity/cepyq37.png", "question": "The potential difference (VA – VB) between the points A and B in the given figure is:", "o1": "+6 V", "o2": "-3 V", "o3": "+3 V", "o4": "9 V" },
  {"ans":"o1","qid":"cepyq38","tag":"NEET(UG) 2016","fig":null, "question": "A filament bulb (500 W, 100 V) is to be used in a 230 V main supply. When a resistance R is connected in series, it works perfectly and the bulb consumes 500 W. The value of R is:", "o1": "26 Ω", "o2": "230 Ω", "o3": "13 Ω", "o4": "46 Ω" },
  {"ans":"o2","qid":"cepyq39","tag":"NEET(UG) 2017","fig":null, "question": "The resistance of a wire is 'R' ohm. If it is melted and stretched to 'n' times its original length, its new resistance will be:", "o1": "nR", "o2": "n²R", "o3": "2nR", "o4": "n²R" },
  {"ans":"o2","qid":"cepyq40","tag":"NEET(UG) 2017","fig":null, "question": "A potentiometer is an accurate and versatile device to make electrical measurements of E.M.F. because the method involves:", "o1": "Potential gradients", "o2": "A condition of no current flow through the galvanometer", "o3": "A combination of cells, galvanometer and resistances", "o4": "Cells" },
  {"ans":"o1","qid":"cepyq41","tag":"NEET(UG) 2018","fig":null, "question": "A set of 'n' equal resistors, of value 'R' each, are connected in series to a battery of emf 'E' and internal resistance 'R'. The current drawn is I. Now, the 'n' resistors are connected in parallel to the same battery. Then the current drawn from battery becomes 10 I. The value of 'n' is:", "o1": "10", "o2": "11", "o3": "20", "o4": "9" },
  {"ans":"o1","qid":"cepyq42","tag":"NEET(UG) 2018","fig":null, "question": "A battery consists of a variable number 'n' of identical cells (having internal resistance 'r' each) which are connected in series. The terminals of the battery are short-circuited and the current I is measured. Which of the graphs shows the correct relationship between I and n?", "o1": "Graph 1", "o2": "Graph 2", "o3": "Graph 3", "o4": "Graph 4" },
  {"ans":"o2","qid":"cepyq43","tag":"NEET(UG) 2018","fig":null, "question": "A carbon resistor (47 ± 4.7) kΩ is to be marked with rings of different colours for its identification. The colour code sequence will be:", "o1": "Violet – Yellow – Orange – Silver", "o2": "Yellow – Violet – Orange – Silver", "o3": "Yellow – Green – Violet – Gold", "o4": "Green – Orange – Violet – Gold" },
  {"ans":"o3","qid":"cepyq44","tag":"NEET(UG) 2018","fig":null, "question": "Current sensitivity of a moving coil galvanometer is 5 div/mA and its voltage sensitivity (angular deflection per unit voltage applied) is 20 div/V. The resistance of the galvanometer is:", "o1": "40 Ω", "o2": "25 Ω", "o3": "250 Ω", "o4": "500 Ω" },
  {"ans":"o2","qid":"cepyq45","tag":"NEET(UG) 2019","fig":"database/figures/current-electricity/cepyq45.png", "question": "Six similar bulbs are connected as shown in the figure with a DC source of emf E, and zero internal resistance. The ratio of power consumption by the bulbs when (i) all are glowing and (ii) in the situation when two from section A and one from section B are glowing, will be:", "o1": "4 : 9", "o2": "9 : 4", "o3": "1 : 2", "o4": "2 : 3" },
  {"ans":"o4","qid":"cepyq46","tag":"NEET(UG) 2019","fig":null, "question": "Which of the following acts as a circuit protection device?", "o1": "conductor", "o2": "inductor", "o3": "switch", "o4": "fuse" },
  {"ans":"o3","qid":"cepyq47","tag":"NEET(UG) 2019","fig":"database/figures/current-electricity/cepyq47.png", "question": "In the circuits shown below, the readings of the voltmeters and the ammeters will be:", "o1": "V2 > V1 and i1 = i2", "o2": "V1 = V2 and i1 > i2", "o3": "V1 = V2 and i1 = i2", "o4": "V2 > V1 and i1 > i2" },
  {"ans":"o4","qid":"cepyq48","tag":"NEET(UG) 2019","fig":"database/figures/current-electricity/cepyq48.png", "question": "The reading of an ideal voltmeter in the circuit shown is:", "o1": "0.6 V", "o2": "0 V", "o3": "0.5 V", "o4": "0.4 V" },
  {"ans":"o4","qid":"cepyq49","tag":"NEET(UG) 2019","fig":"database/figures/current-electricity/cepyq49.png", "question": "The metre bridge shown is in balanced position with P/Q = λ1/λ2. If we now interchange the positions of galvanometer and cell, will the bridge work? If yes, what will be balance condition?", "o1": "yes, P/Q = λ1/λ2", "o2": "no, no null point", "o3": "yes, P/Q = λ2/λ1", "o4": "yes, P/Q = λ2/λ1" },
  {"ans":"o1","qid":"cepyq50","tag":"NEET(UG) 2020","fig":null, "question": "The color code of a resistance is given below: Yellow, Violet, Brown, Gold. The values of resistance and tolerance, respectively, are:", "o1": "470 Ω, 5%", "o2": "470 kΩ, 5%", "o3": "47 kΩ, 10%", "o4": "4.7 kΩ, 5%" },
  {"ans":"o3","qid":"cepyq51","tag":"NEET(UG) 2020","fig":null, "question": "A charged particle having drift velocity of 7.5 × 10–4 m/s is in an electric field of 3 × 10–10 V/m, has a mobility in m²/V·s of:", "o1": "2.25 × 10–15", "o2": "2.25 × 10¹⁵", "o3": "2.5 × 10⁶", "o4": "2.5 × 10–6" },
  {"ans":"o4","qid":"cepyq52","tag":"NEET(UG) 2020","fig":null, "question": "Which of the following graph represents the variation of resistivity (ρ) with temperature (T) for copper?", "o1": "ρ increases linearly with T", "o2": "ρ decreases with T", "o3": "ρ increases exponentially with T", "o4": "ρ remains constant with T" },
  {"ans":"o3","qid":"cepyq53","tag":"NEET(UG) 2020","fig":null, "question": "A resistance wire connected in the left gap of a metre bridge balances a 10 Ω resistance in the right gap at a point which divides the bridge wire in the ratio 3 : 2. If the length of the resistance wire is 1.5 m, then the length of 1 Ω of the resistance wire is:", "o1": "1.5 × 10–2 m", "o2": "1.0 × 10–2 m", "o3": "1.0 × 10–1 m", "o4": "1.5 × 10–1 m" },
  {"ans":"o2","qid":"cepyq54","tag":"NEET(UG) 2020","fig":"database/figures/current-electricity/cepyq54.png", "question": "For the circuit shown in the figure, the current I will be:", "o1": "0.75 A", "o2": "1 A", "o3": "1.5 A", "o4": "0.5 A" },
  {"ans":"o2","qid":"cepyq55","tag":"NEET(UG) 2020","fig":"database/figures/current-electricity/cepyq55.png", "question": "For the circuit given below, the Kirchoff's loop rule for the loop BCDEB is given by the equation:", "o1": "–i2R2 + E2 – E3 + i3R1 = 0", "o2": "i2R2 + E2 – E3 – i3R1 = 0", "o3": "i2R2 + E2 + E3 + i3R1 = 0", "o4": "– i2R2 + E2 + E3 + i3R1 = 0" },
  {"ans":"o2","qid":"cepyq56","tag":"NEET(UG) 2020","fig":"database/figures/current-electricity/cepyq56.png", "question": "The equivalent resistance between A and B for the mesh shown in the figure is:", "o1": "7.2 Ω", "o2": "16 Ω", "o3": "30 Ω", "o4": "4.8 Ω" },
  {"ans":"o2","qid":"cepyq57","tag":"NEET(UG) 2020","fig":null, "question": "Two solid conductors are made up of same material, have same length and same resistance. One of them has a circular cross section of area A1 and the other one has a square cross section of area A2. The ratio A1/A2 is:", "o1": "1.5", "o2": "1", "o3": "0.8", "o4": "2" },
  {"ans":"o1","qid":"cepyq58","tag":"NEET(UG) 2021","fig":"database/figures/current-electricity/cepyq58.png", "question": "Column-I gives certain physical terms associated with flow of current through a metallic conductor. Column-II gives some mathematical relations involving electrical quantities. Match Column-I and Column-II with appropriate relations.", "o1": "(A)-(R), (B)-(S), (C)-(P), (D)-(Q)", "o2": "(A)-(R), (B)-(S), (C)-(Q), (D)-(P)", "o3": "(A)-(R), (B)-(P), (C)-(S), (D)-(Q)", "o4": "(A)-(R), (B)-(Q), (C)-(S), (D)-(P)" },
  {"ans":"o4","qid":"cepyq59","tag":"NEET(UG) 2021","fig":null, "question": "The effective resistance of a parallel connection that consists of four wires of equal length, equal area of cross-section and same material is 0.25 Ω. What will be the effective resistance if they are connected in series?", "o1": "0.25 Ω", "o2": "0.5 Ω", "o3": "1 Ω", "o4": "4 Ω" },
  {"ans":"o1","qid":"cepyq60","tag":"NEET(UG) 2021","fig":null, "question": "In a potentiometer circuit a cell of EMF 1.5 V gives balance point at 36 cm length of wire. If another cell of EMF 2.5 V replaces the first cell, then at what length of the wire, the balance point occurs?", "o1": "60 cm", "o2": "21.6 cm", "o3": "64 cm", "o4": "62 cm" },
  {"ans":"o2","qid":"cepyq61","tag":"NEET(UG) 2021","fig":"database/figures/current-electricity/cepyq61.png", "question": "Three resistors having resistances r1, r2, and r3 are connected as shown in the given circuit. The ratio i1/i2 of currents in terms of resistances used in the circuit is:", "o1": "(r1 + r2) / (r2 + r3)", "o2": "(r2 + r3) / (r1 + r3)", "o3": "(r1 + r2) / (r1 + r3)", "o4": "(r1 + r3) / (r2 + r3)" },
  {"ans":"o3","qid":"cepyq62","tag":"NEET(UG) 2021","fig":"database/figures/current-electricity/cepyq62.png", "question": "Five bulbs each have same voltage rating 220 V are connected as shown in the figure. The total power consumed in the circuit is:", "o1": "20 W", "o2": "40 W", "o3": "60 W", "o4": "100 W" },
  {"ans":"o4","qid":"cepyq63","tag":"NEET(UG) 2021","fig":"database/figures/current-electricity/cepyq63.png", "question": "In the circuit as shown, the reading of ideal ammeter is:", "o1": "5 A", "o2": "8 A", "o3": "9 A", "o4": "10 A" },
  {"ans":"o2","qid":"cepyq64","tag":"NEET(UG) 2021","fig":null, "question": "Kirchhoff's voltage law is based on the conservation of:", "o1": "Charge", "o2": "Energy", "o3": "Momentum", "o4": "Current" },
  {"ans":"o1","qid":"cepyq65","tag":"NEET(UG) 2022","fig":null, "question": "Two resistors of resistance, 100 Ω and 200 Ω are connected in parallel in an electrical circuit. The ratio of the thermal energy developed in 100 Ω to that in 200 Ω in a given time is:", "o1": "2 : 1", "o2": "1 : 4", "o3": "4 : 1", "o4": "1 : 2" },
  {"ans":"o2","qid":"cepyq66","tag":"NEET(UG) 2022","fig":null, "question": "As the temperature increase, the electrical resistance:", "o1": "decreases for both conductors and semiconductors", "o2": "increases for conductors but decreases for semiconductors", "o3": "decreases for conductors but increases for semiconductors", "o4": "increases for both conductors and semiconductors" },
  {"ans":"o3","qid":"cepyq67","tag":"NEET(UG) 2022","fig":null, "question": "A copper wire of length 10 m and radius ( )–2 10 / m π has electrical resistance of 10 Ω. The current density in the wire for an electric field strength of 10 (V/m) is:", "o1": "106 A/m2", "o2": "10–5 A/m2", "o3": "105 A/m2", "o4": "104 A/m2" },
  {"ans":"o1","qid":"cepyq68","tag":"NEET(UG) 2022","fig":"database/figures/current-electricity/cepyq68.png", "question": "A wheatstone bridge is used to determine the value of unknown resistance X by adjusting the variable resistance Y as shown in the figure. For the most precise measurement of X, the resistances P and Q:", "o1": "should be approximately equal and are small", "o2": "should be very large and unequal", "o3": "do not play any significant role", "o4": "should be approximately equal to 2X" },
  {"ans":"o4","qid":"cepyq69","tag":"NEET(UG) 2022","fig":"database/figures/current-electricity/cepyq69.png", "question": "A network of resistors is connected across a 10 V battery with internal resistance of 1 Ω as shown in the circuit diagram. The equivalent resistance of the circuit is:", "o1": "14/3 Ω", "o2": "12/7 Ω", "o3": "14/7 Ω", "o4": "17/3 Ω" },
  {"ans":"o4","qid":"cepyq70","tag":"NEET(UG) 2022","fig":null, "question": "The plot of current I flowing through a conductor versus the applied voltage V across the ends of a conductor is:", "o1": "linear with a positive slope", "o2": "linear with a negative slope", "o3": "parabolic with a positive curve", "o4": "parabolic with a negative curve" },
  {"ans":"o3","qid":"cepyq71","tag":"NEET(UG) 2022","fig":null, "question": "The value of resistance for the colour code of the given resistor is: Orange Yellow Blue Gold", "o1": "(470 ± 47) kΩ", "o2": "(360 ± 36) kΩ", "o3": "(360 ± 18) kΩ", "o4": "(36 ± 36) kΩ" },
  {"ans":"o2","qid":"cepyq72","tag":"NEET(UG) 2022","fig":"database/figures/current-electricity/cepyq72.png", "question": "In a metre bridge experiment, the null point is at a distance of 30 cm from A. If a resistance of 16Ω is connected in parallel with resistance Y, the null point occurs at 50 cm from A. The value of the resistance Y is:", "o1": "40/3 Ω", "o2": "64/3 Ω", "o3": "48/3 Ω", "o4": "112/3 Ω" },
  {"ans":"o1","qid":"cepyq73","tag":"NEET(UG) 2022","fig":null, "question": "A cell of emf 4 V and internal resistance 0.5 Ω is connected to a 7.5 Ω external resistance. The terminal potential difference of the cell is:", "o1": "3.75 V", "o2": "4.25 V", "o3": "4 V", "o4": "0.375 V" },
  {"ans":"o3","qid":"cepyq74","tag":"NEET(UG) 2022","fig":"database/figures/current-electricity/cepyq74.png", "question": "The equivalent resistance of the infinite network given below is:", "o1": "2 Ω", "o2": "1 Ω", "o3": "1/3 Ω", "o4": "3 Ω" },
  {"ans":"o4","qid":"cepyq75","tag":"NEET(UG) 2022","fig":null, "question": "The reciprocal of resistance is:", "o1": "reactance", "o2": "mobility", "o3": "conductivity", "o4": "conductance" },
  {"ans":"o1","qid":"cepyq76","tag":"NEET(UG) 2022","fig":"database/figures/current-electricity/cepyq76.png", "question": "The sliding contact C is at one fourth of the length of the potentiometer wire (AB) from A as shown in the circuit diagram. If the resistance of the wire AB is R0, then the potential drop (V) across the resistor R is:", "o1": "V = 1/4", "o2": "V = 3/4", "o3": "V = 1/2", "o4": "V = 1/16" }
]
