[
  {"ans":"o4","qid":"ce-pyq-1","tag":"AIPMT 2006","fig":"database/figures/current-electricity/cepyq1.jpeg", "question": "In the circuit shown, if a conducting wire is connected between points A and B, the current in this wire will :-", "o1": "flow from A to B", "o2": "flow in the direction which will be decided by the value of V", "o3": "be zero", "o4": "flow from B to A" },
  {"ans":"o3","qid":"ce-pyq-2","tag":"AIPMT 2007","fig":null, "question": "The resistance of an ammeter is 13 Ω and its scale is graduated for currents up to 100 A. After an additional shunt is connected to this ammeter it becomes possible to measure currents up to 750 amperes by this meter. The value of shunt resistance is :-", "o1": "2 kΩ", "o2": "20 Ω", "o3": "2 Ω", "o4": "0.2 Ω" },
  {"ans":"o2","qid":"ce-pyq-3","tag":"AIPMT 2008","fig":"database/figures/current-electricity/cepyq3.jpeg", "question": "In the circuit shown, the current through the 4 Ω resistor is 1 A when the points P and M are connected to a d.c. voltage source. The potential difference between the points M and N is :-", "o1": "0.5 volts", "o2": "3.2 volts", "o3": "1.5 volts", "o4": "1.0 volt" },
  {"ans":"o2","qid":"ce-pyq-4","tag":"AIPMT 2008","fig":null, "question": "A galvanometer of resistance 50 Ω is connected to a battery of 3 V along with a resistance of 2950 Ω in series. A full scale deflection of 30 divisions is obtained in the galvanometer. In order to reduce this deflection to 20 divisions, the resistance in series should be :-", "o1": "6050 Ω", "o2": "4450 Ω", "o3": "5050 Ω", "o4": "5550 Ω" },
  {"ans":"o2","qid":"ce-pyq-5","tag":"AIPMT 2008","fig":"database/figures/current-electricity/cepyq5.jpeg", "question": "A current of 3 amperes flows through the 2 Ω resistor shown in the circuit. The power dissipated in the 5 Ω resistor is :-", "o1": "1 watt", "o2": "5 watts", "o3": "4 watts", "o4": "2 watts" },
  {"ans":"o2","qid":"ce-pyq-6","tag":"AIPMT 2009","fig":"database/figures/current-electricity/cepyq6.jpeg", "question": "A wire of resistance 12 ohms per meter is bent to form a complete circle of radius 10 cm. The resistance between its two diametrically opposite points, A and B as shown in the figure, is :-", "o1": "6 Ω", "o2": "0.6π Ω", "o3": "3 Ω", "o4": "6π Ω" },
  {"ans":"o2","qid":"ce-pyq-7","tag":"AIPMT 2009","fig":"database/figures/current-electricity/cepyq7.jpeg", "question": "See the electrical circuit shown in this figure. Which of the following equations is the correct equation for it ?", "o1": "ε1 – (i1 + i2 )R + i1 r1 = 0", "o2": "ε1 – (i1 + i2 )R - i1 r1 = 0", "o3": "ε2 - i2 r2 - ε1 - i1 r1 = 0", "o4": "-ε2 - (i1 + i2 )R + i2 r2 = 0" },
  {"ans":"o1","qid":"ce-pyq-8","tag":"AIPMT 2009","fig":null, "question": "A galvanometer having a coil resistance of 60 Ω shows full scale deflection when a current of 1.0 A passes through it. It can be converted into an ammeter to read currents up to 5.0 A by :-", "o1": "putting in parallel a resistance of 15 Ω", "o2": "putting in parallel a resistance of 240 Ω", "o3": "putting in series a resistance of 15 Ω", "o4": "putting in series a resistance of 240 Ω" },
  {"ans":"o3","qid":"ce-pyq-9","tag":"AIPMT 2009","fig":null, "question": "A student measures the terminal potential difference (V) of a cell (of emf ε and internal resistance r) as a function of the current (I) flowing through it. The slope and intercept of the graph between V and I, then respectively, are :-", "o1": "–ε and r", "o2": "-r and ε", "o3": "ε and -r", "o4": "r and –ε" },
  {"ans":"o3","qid":"ce-pyq-10","tag":"AIPMT 2010","fig":"database/figures/current-electricity/cepyq10.png", "question": "A potentiometer circuit is set up as shown. The potential gradient, across the potentiometer wire, is k volts/cm and the ammeter, present in the circuit, reads 1.0 A when two way key is switched off. The balance points, when the key between the terminals (i) 1 and 2 (ii) 1 and 3, is plugged in, are found to be at lengths 1 cm and 2 cm respectively. The magnitudes, of the resistors R and X, (in ohms), are then, equal to respectively :-", "o1": "k1 and k2", "o2": "k1 and k(2 – 1)", "o3": "k(2 – 1) and k2", "o4": "k(2 – 1) and k1" },
  {"ans":"o2","qid":"ce-pyq-11","tag":"AIPMT 2010","fig":null, "question": "A galvanometer has a coil of resistance 100 ohms and gives full scale deflection for 30 mA current. If it is to work as a voltmeter of 30 volt range, the resistance required to be added will be:-", "o1": "1000 Ω", "o2": "900 Ω", "o3": "1800 Ω", "o4": "500 Ω" },
  {"ans":"o1","qid":"ce-pyq-12","tag":"AIPMT 2010","fig":null, "question": "Consider the following two statements : (A) Kirchhoff's junction law follows from the conservation of charge. (B) Kirchhoff's loop law follows from the conservation of energy. Which of the following is correct ?", "o1": "Both (A) and (B) are correct", "o2": "Both (A) and (B) are wrong", "o3": "(A) is correct and (B) is wrong", "o4": "(A) is wrong and (B) is correct" },
  {"ans":"o2","qid":"ce-pyq-13","tag":"AIPMT 2011","fig":null, "question": "A current of 2 A flows through a 2 Ω resistor when connected across a battery. The same battery supplies a current of 0.5 A when connected across a 9 Ω resistor. The internal resistance of the battery is :-", "o1": "0.5 Ω", "o2": "1/3 Ω", "o3": "1/4 Ω", "o4": "1 Ω" },
  {"ans":"o3","qid":"ce-pyq-14","tag":"AIPMT 2011","fig":"database/figures/current-electricity/cepyq14.png", "question": "If power dissipated in the 9 Ω resistor in the circuit shown is 36 Watt, the potential difference across the 2 Ω resistor is :-", "o1": "4 V", "o2": "8 V", "o3": "10 V", "o4": "2 V" },
  {"ans":"o1","qid":"ce-pyq-15","tag":"AIPMT 2011","fig":"database/figures/current-electricity/cepyq15.png", "question": "In the circuit shown in the figure, if the potential at point A is taken to be zero, the potential at point B is :-", "o1": "+1 V", "o2": "-1 V", "o3": "+2 V", "o4": "-2 V" },
  {"ans":"o4","qid":"ce-pyq-16","tag":"AIPMT 2011","fig":null, "question": "A galvanometer of resistance, G, is shunted by a resistance S. To keep the main current in the circuit unchanged, the resistance to be put in series with the arrangement is:", "o1": "G(S+G)", "o2": "2S(S+G)", "o3": "SG(S+G)", "o4": "2G(S+G)" },
  {"ans":"o2","qid":"ce-pyq-17","tag":"AIPMT 2012","fig":"database/figures/current-electricity/cepyq17.png", "question": "A ring is made of a wire having a resistance R0 = 12 Ω. Find the points A and B at which a current carrying conductor should be connected so that the resistance R of the sub circuit between these points is equal to 8/3 Ω:", "o1": "1/2 = λ/λ", "o2": "1/2 = 1/2 = λ/λ", "o3": "1/2 = 5/8 = λ/λ", "o4": "1/2 = 1/3 = λ/λ" },
  {"ans":"o1","qid":"ce-pyq-18","tag":"AIPMT 2012","fig":null, "question": "If voltage across a bulb rated 220 volts 100 watts drops by 2.5% of its rated value, the percentage of the rated value by which the power would decrease is:", "o1": "5%", "o2": "10%", "o3": "20%", "o4": "2.5%" },
  {"ans":"o4","qid":"ce-pyq-19","tag":"AIPMT 2012","fig":"database/figures/current-electricity/cepyq19.png", "question": "In the circuit shown, the cells A and B have negligible resistances. For VA = 12 V, R1 = 500 Ω and R = 100 Ω, the galvanometer (G) shows no deflection. The value of VB is:", "o1": "12 V", "o2": "6 V", "o3": "4 V", "o4": "2 V" },
  {"ans":"o3","qid":"ce-pyq-20","tag":"AIPMT 2012","fig":null, "question": "A millivoltmeter of 25 millivolts range is to be converted into an ammeter of 25 amperes range. The value (in ohms) of necessary shunt will be:", "o1": "1", "o2": "0.05", "o3": "0.001", "o4": "0.01" },
  {"ans":"o1","qid":"ce-pyq-21","tag":"AIPMT 2012","fig":"database/figures/current-electricity/cepyq21.png", "question": "The power dissipated in the circuit shown in the figure is 30 watts. The value of R is:", "o1": "10 Ω", "o2": "30 Ω", "o3": "20 Ω", "o4": "15 Ω" },
  {"ans":"o1","qid":"ce-pyq-22","tag":"AIPMT 2012","fig":null, "question": "A cell having an emf ε and internal resistance r is connected across a variable external resistance R. As the resistance R is increased, the plot of potential difference V across R is given by:", "o1": "εV0/R", "o2": "V0/R", "o3": "εV0/R", "o4": "εV0/R" },
  {"ans":"o1","qid":"ce-pyq-23","tag":"NEET(UG) 2013","fig":null, "question": "A wire of resistance 4 Ω is stretched to twice its original length. The resistance of the stretched wire would be:", "o1": "16 Ω", "o2": "2 Ω", "o3": "4 Ω", "o4": "8 Ω" },
  {"ans":"o3","qid":"ce-pyq-24","tag":"NEET(UG) 2013","fig":null, "question": "The internal resistance of a 2.1 V cell which gives a current of 0.2 A through a resistance of 10 Ω is:", "o1": "1.0 Ω", "o2": "0.2 Ω", "o3": "0.5 Ω", "o4": "0.8 Ω" },
  {"ans":"o3","qid":"ce-pyq-25","tag":"NEET(UG) 2013","fig":null, "question": "The resistances of the four arms P, Q, R, and S in a Wheatstone bridge are 10 ohms, 30 ohms, 30 ohms, and 90 ohms, respectively. The e.m.f. and internal resistance of the cell are 7 volts and 5 ohms respectively. If the galvanometer resistance is 50 ohms, the current drawn from the cell will be:", "o1": "2.0 A", "o2": "1.0 A", "o3": "0.2 A", "o4": "0.1 A" },
  {"ans":"o2","qid":"ce-pyq-26","tag":"AIPMT 2014","fig":null, "question": "Two cities are 150 km apart. Electric power is sent from one city to another city through copper wires. The fall of potential per km is 8 volts and the average resistance per km is 0.5 Ω. The power loss in the wires is:", "o1": "19.2 W", "o2": "19.2 kW", "o3": "19.2 J", "o4": "12.2 kW" },
  {"ans":"o2","qid":"ce-pyq-27","tag":"AIPMT 2014","fig":"database/figures/current-electricity/cepyq27.png", "question": "The resistance in the two arms of a meter bridge are 5 Ω and R Ω, respectively. When the resistance R is shunted with an equal resistance, the new balance point is at 1.6 λ1. The resistance ‘R’ is:", "o1": "10 Ω", "o2": "15 Ω", "o3": "20 Ω", "o4": "25 Ω" },
  {"ans":"o3","qid":"ce-pyq-28","tag":"AIPMT 2014","fig":null, "question": "A potentiometer circuit has been set up for finding the internal resistance of a given cell. The main battery, used across the potentiometer wire, has an emf of 2.0 V and a negligible internal resistance. The potentiometer wire itself is 4m long. When a resistance R, connected across the given cell, has values of (i) infinity (ii) 9.5 Ω, the balancing lengths on the potentiometer wire are found to be 3 m and 2.85 m respectively. The value of internal resistance of the cell is:", "o1": "0.25 Ω", "o2": "0.95 Ω", "o3": "0.5 Ω", "o4": "0.75 Ω" },
  {"ans":"o3","qid":"ce-pyq-29","tag":"AIPMT 2014","fig":null, "question": "In an ammeter 0.2% of main current passes through the galvanometer. If resistance of galvanometer is G, then resistance of ammeter will be:", "o1": "1/499 G", "o2": "499/500 G", "o3": "1/500 G", "o4": "500/499 G" },
  {"ans":"o3","qid":"ce-pyq-30","tag":"AIPMT 2015","fig":null, "question": "A potentiometer wire of length L and resistance r is connected in series with a battery of e.m.f. E0 and a resistance r1. An unknown e.m.f. E is balanced at a length λ of the potentiometer wire. The e.m.f. E will be given by:", "o1": "(E0(r1 + r)λ)/(r1 + r)", "o2": "(E0 r λ)/(r1 + r)", "o3": "(E0 r L + λ)/(r1 + r)", "o4": "(E0 L λ)" },
  {"ans":"o2","qid":"ce-pyq-31","tag":"AIPMT 2015","fig":null, "question": "Two metal wires of identical dimensions are connected in series. If σ1 and σ2 are the conductivities of the metal wires respectively, the effective conductivity of the combination is:", "o1": "σ1 + σ2", "o2": "σ1 + σ2/σ1σ2", "o3": "σ1σ2 / (σ1 + σ2)", "o4": "σ1σ2 + σ1 + σ2" },
  {"ans":"o2","qid":"ce-pyq-32","tag":"AIPMT 2015","fig":null, "question": "A circuit contains an ammeter, a battery of 30 V, and a resistance of 40.8 ohm all connected in series. If the ammeter has a coil of resistance 480 ohm and a shunt of 20 ohm, the reading in the ammeter will be:", "o1": "1 A", "o2": "0.5 A", "o3": "0.25 A", "o4": "2 A" },
  {"ans":"o1","qid":"ce-pyq-33","tag":"AIPMT 2015","fig":null, "question": "Across a metallic conductor of non-uniform cross section, a constant potential difference is applied. The quantity which remains constant along the conductor is:", "o1": "current", "o2": "drift velocity", "o3": "electric field", "o4": "current density" },
  {"ans":"o4","qid":"ce-pyq-34","tag":"AIPMT 2015","fig":null, "question": "A potentiometer wire has length 4 m and resistance 8Ω. The resistance that must be connected in series with the wire and an accumulator of e.m.f. 2V, so as to get a potential gradient 1 mV per cm on the wire is:", "o1": "40 Ω", "o2": "44 Ω", "o3": "48 Ω", "o4": "32 Ω" },
  {"ans":"o4","qid":"ce-pyq-35","tag":"AIPMT 2015","fig":"database/figures/current-electricity/cepyq35.png", "question": "A, B and C are voltmeters of resistance R, 1.5 R and 3R respectively as shown in the figure. When some potential difference is applied between X and Y, the voltmeter readings are VA, VB and VC respectively. Then:", "o1": "VA ≠ VB = VC", "o2": "VA = VB ≠ VC", "o3": "VA ≠ VB ≠ VC", "o4": "VA = VB = VC" },
  {"ans":"o4","qid":"ce-pyq-36","tag":"NEET(UG) 2016","fig":null, "question": "A potentiometer wire is 100 cm long and a constant potential difference is maintained across it. Two cells are connected in series first to support one another and then in opposite direction. The balance points are obtained at 50 cm and 10 cm from the positive end of the wire in the two cases. The ratio of emf's is:", "o1": "5 : 1", "o2": "5 : 4", "o3": "3 : 4", "o4": "3 : 2" },
  {"ans":"o2","qid":"ce-pyq-37","tag":"NEET(UG) 2016","fig":"database/figures/current-electricity/cepyq37.png", "question": "The potential difference (VA – VB) between the points A and B in the given figure is:", "o1": "+6 V", "o2": "-3 V", "o3": "+3 V", "o4": "9 V" },
  {"ans":"o1","qid":"ce-pyq-38","tag":"NEET(UG) 2016","fig":null, "question": "A filament bulb (500 W, 100 V) is to be used in a 230 V main supply. When a resistance R is connected in series, it works perfectly and the bulb consumes 500 W. The value of R is:", "o1": "26 Ω", "o2": "230 Ω", "o3": "13 Ω", "o4": "46 Ω" },
  {"ans":"o2","qid":"ce-pyq-39","tag":"NEET(UG) 2017","fig":null, "question": "The resistance of a wire is 'R' ohm. If it is melted and stretched to 'n' times its original length, its new resistance will be:", "o1": "nR", "o2": "n²R", "o3": "2nR", "o4": "n²R" },
  {"ans":"o2","qid":"ce-pyq-40","tag":"NEET(UG) 2017","fig":null, "question": "A potentiometer is an accurate and versatile device to make electrical measurements of E.M.F. because the method involves:", "o1": "Potential gradients", "o2": "A condition of no current flow through the galvanometer", "o3": "A combination of cells, galvanometer and resistances", "o4": "Cells" },
  {"ans":"o1","qid":"ce-pyq-41","tag":"NEET(UG) 2018","fig":null, "question": "A set of 'n' equal resistors, of value 'R' each, are connected in series to a battery of emf 'E' and internal resistance 'R'. The current drawn is I. Now, the 'n' resistors are connected in parallel to the same battery. Then the current drawn from battery becomes 10 I. The value of 'n' is:", "o1": "10", "o2": "11", "o3": "20", "o4": "9" },
  {"ans":"o1","qid":"ce-pyq-42","tag":"NEET(UG) 2018","fig":null, "question": "A battery consists of a variable number 'n' of identical cells (having internal resistance 'r' each) which are connected in series. The terminals of the battery are short-circuited and the current I is measured. Which of the graphs shows the correct relationship between I and n?", "o1": "Graph 1", "o2": "Graph 2", "o3": "Graph 3", "o4": "Graph 4" },
  {"ans":"o2","qid":"ce-pyq-43","tag":"NEET(UG) 2018","fig":null, "question": "A carbon resistor (47 ± 4.7) kΩ is to be marked with rings of different colours for its identification. The colour code sequence will be:", "o1": "Violet – Yellow – Orange – Silver", "o2": "Yellow – Violet – Orange – Silver", "o3": "Yellow – Green – Violet – Gold", "o4": "Green – Orange – Violet – Gold" },
  {"ans":"o3","qid":"ce-pyq-44","tag":"NEET(UG) 2018","fig":null, "question": "Current sensitivity of a moving coil galvanometer is 5 div/mA and its voltage sensitivity (angular deflection per unit voltage applied) is 20 div/V. The resistance of the galvanometer is:", "o1": "40 Ω", "o2": "25 Ω", "o3": "250 Ω", "o4": "500 Ω" },
  {"ans":"o2","qid":"ce-pyq-45","tag":"NEET(UG) 2019","fig":"database/figures/current-electricity/cepyq45.png", "question": "Six similar bulbs are connected as shown in the figure with a DC source of emf E, and zero internal resistance. The ratio of power consumption by the bulbs when (i) all are glowing and (ii) in the situation when two from section A and one from section B are glowing, will be:", "o1": "4 : 9", "o2": "9 : 4", "o3": "1 : 2", "o4": "2 : 3" },
  {"ans":"o4","qid":"ce-pyq-46","tag":"NEET(UG) 2019","fig":null, "question": "Which of the following acts as a circuit protection device?", "o1": "conductor", "o2": "inductor", "o3": "switch", "o4": "fuse" },
  {"ans":"o3","qid":"ce-pyq-47","tag":"NEET(UG) 2019","fig":"database/figures/current-electricity/cepyq47.png", "question": "In the circuits shown below, the readings of the voltmeters and the ammeters will be:", "o1": "V2 > V1 and i1 = i2", "o2": "V1 = V2 and i1 > i2", "o3": "V1 = V2 and i1 = i2", "o4": "V2 > V1 and i1 > i2" },
  {"ans":"o4","qid":"ce-pyq-48","tag":"NEET(UG) 2019","fig":"database/figures/current-electricity/cepyq48.png", "question": "The reading of an ideal voltmeter in the circuit shown is:", "o1": "0.6 V", "o2": "0 V", "o3": "0.5 V", "o4": "0.4 V" },
  {"ans":"o4","qid":"ce-pyq-49","tag":"NEET(UG) 2019","fig":"database/figures/current-electricity/cepyq49.png", "question": "The metre bridge shown is in balanced position with P/Q = λ1/λ2. If we now interchange the positions of galvanometer and cell, will the bridge work? If yes, what will be balance condition?", "o1": "yes, P/Q = λ1/λ2", "o2": "no, no null point", "o3": "yes, P/Q = λ2/λ1", "o4": "yes, P/Q = λ2/λ1" },
  {"ans":"o1","qid":"ce-pyq-50","tag":"NEET(UG) 2020","fig":null, "question": "The color code of a resistance is given below: Yellow, Violet, Brown, Gold. The values of resistance and tolerance, respectively, are:", "o1": "470 Ω, 5%", "o2": "470 kΩ, 5%", "o3": "47 kΩ, 10%", "o4": "4.7 kΩ, 5%" },
  {"ans":"o3","qid":"ce-pyq-51","tag":"NEET(UG) 2020","fig":null, "question": "A charged particle having drift velocity of 7.5 × 10–4 m/s is in an electric field of 3 × 10–10 V/m, has a mobility in m²/V·s of:", "o1": "2.25 × 10–15", "o2": "2.25 × 10¹⁵", "o3": "2.5 × 10⁶", "o4": "2.5 × 10–6" },
  {"ans":"o4","qid":"ce-pyq-52","tag":"NEET(UG) 2020","fig":null, "question": "Which of the following graph represents the variation of resistivity (ρ) with temperature (T) for copper?", "o1": "ρ increases linearly with T", "o2": "ρ decreases with T", "o3": "ρ increases exponentially with T", "o4": "ρ remains constant with T" },
  {"ans":"o3","qid":"ce-pyq-53","tag":"NEET(UG) 2020","fig":null, "question": "A resistance wire connected in the left gap of a metre bridge balances a 10 Ω resistance in the right gap at a point which divides the bridge wire in the ratio 3 : 2. If the length of the resistance wire is 1.5 m, then the length of 1 Ω of the resistance wire is:", "o1": "1.5 × 10–2 m", "o2": "1.0 × 10–2 m", "o3": "1.0 × 10–1 m", "o4": "1.5 × 10–1 m" },
  {"ans":"o2","qid":"ce-pyq-54","tag":"NEET(UG) 2020","fig":"database/figures/current-electricity/cepyq54.png", "question": "For the circuit shown in the figure, the current I will be:", "o1": "0.75 A", "o2": "1 A", "o3": "1.5 A", "o4": "0.5 A" },
  {"ans":"o2","qid":"ce-pyq-55","tag":"NEET(UG) 2020","fig":"database/figures/current-electricity/cepyq55.png", "question": "For the circuit given below, the Kirchoff's loop rule for the loop BCDEB is given by the equation:", "o1": "–i2R2 + E2 – E3 + i3R1 = 0", "o2": "i2R2 + E2 – E3 – i3R1 = 0", "o3": "i2R2 + E2 + E3 + i3R1 = 0", "o4": "– i2R2 + E2 + E3 + i3R1 = 0" },
  {"ans":"o2","qid":"ce-pyq-56","tag":"NEET(UG) 2020","fig":"database/figures/current-electricity/cepyq56.png", "question": "The equivalent resistance between A and B for the mesh shown in the figure is:", "o1": "7.2 Ω", "o2": "16 Ω", "o3": "30 Ω", "o4": "4.8 Ω" },
  {"ans":"o2","qid":"ce-pyq-57","tag":"NEET(UG) 2020","fig":null, "question": "Two solid conductors are made up of same material, have same length and same resistance. One of them has a circular cross section of area A1 and the other one has a square cross section of area A2. The ratio A1/A2 is:", "o1": "1.5", "o2": "1", "o3": "0.8", "o4": "2" },
  {"ans":"o1","qid":"ce-pyq-58","tag":"NEET(UG) 2021","fig":"database/figures/current-electricity/cepyq58.png", "question": "Column-I gives certain physical terms associated with flow of current through a metallic conductor. Column-II gives some mathematical relations involving electrical quantities. Match Column-I and Column-II with appropriate relations.", "o1": "(A)-(R), (B)-(S), (C)-(P), (D)-(Q)", "o2": "(A)-(R), (B)-(S), (C)-(Q), (D)-(P)", "o3": "(A)-(R), (B)-(P), (C)-(S), (D)-(Q)", "o4": "(A)-(R), (B)-(Q), (C)-(S), (D)-(P)" },
  {"ans":"o4","qid":"ce-pyq-59","tag":"NEET(UG) 2021","fig":null, "question": "The effective resistance of a parallel connection that consists of four wires of equal length, equal area of cross-section and same material is 0.25 Ω. What will be the effective resistance if they are connected in series?", "o1": "0.25 Ω", "o2": "0.5 Ω", "o3": "1 Ω", "o4": "4 Ω" },
  {"ans":"o1","qid":"ce-pyq-60","tag":"NEET(UG) 2021","fig":null, "question": "In a potentiometer circuit a cell of EMF 1.5 V gives balance point at 36 cm length of wire. If another cell of EMF 2.5 V replaces the first cell, then at what length of the wire, the balance point occurs?", "o1": "60 cm", "o2": "21.6 cm", "o3": "64 cm", "o4": "62 cm" },
  {"ans":"o2","qid":"ce-pyq-61","tag":"NEET(UG) 2021","fig":"database/figures/current-electricity/cepyq61.png", "question": "Three resistors having resistances r1, r2, and r3 are connected as shown in the given circuit. The ratio i1/i2 of currents in terms of resistances used in the circuit is:", "o1": "(r1 + r2) / (r2 + r3)", "o2": "(r2 + r3) / (r1 + r3)", "o3": "(r1 + r2) / (r1 + r3)", "o4": "(r1 + r3) / (r2 + r3)" },
  {"ans":"o3","qid":"ce-pyq-62","tag":"NEET(UG) 2021","fig":"database/figures/current-electricity/cepyq62.png", "question": "Five bulbs each have same voltage rating 220 V are connected as shown in the figure. The total power consumed in the circuit is:", "o1": "20 W", "o2": "40 W", "o3": "60 W", "o4": "100 W" },
  {"ans":"o4","qid":"ce-pyq-63","tag":"NEET(UG) 2021","fig":"database/figures/current-electricity/cepyq63.png", "question": "In the circuit as shown, the reading of ideal ammeter is:", "o1": "5 A", "o2": "8 A", "o3": "9 A", "o4": "10 A" },
  {"ans":"o2","qid":"ce-pyq-64","tag":"NEET(UG) 2021","fig":null, "question": "Kirchhoff's voltage law is based on the conservation of:", "o1": "Charge", "o2": "Energy", "o3": "Momentum", "o4": "Current" },
  {"ans":"o1","qid":"ce-pyq-65","tag":"NEET(UG) 2022","fig":null, "question": "Two resistors of resistance, 100 Ω and 200 Ω are connected in parallel in an electrical circuit. The ratio of the thermal energy developed in 100 Ω to that in 200 Ω in a given time is:", "o1": "2 : 1", "o2": "1 : 4", "o3": "4 : 1", "o4": "1 : 2" },
  {"ans":"o2","qid":"ce-pyq-66","tag":"NEET(UG) 2022","fig":null, "question": "As the temperature increase, the electrical resistance:", "o1": "decreases for both conductors and semiconductors", "o2": "increases for conductors but decreases for semiconductors", "o3": "decreases for conductors but increases for semiconductors", "o4": "increases for both conductors and semiconductors" },
  {"ans":"o3","qid":"ce-pyq-67","tag":"NEET(UG) 2022","fig":null, "question": "A copper wire of length 10 m and radius ( )–2 10 / m π has electrical resistance of 10 Ω. The current density in the wire for an electric field strength of 10 (V/m) is:", "o1": "106 A/m2", "o2": "10–5 A/m2", "o3": "105 A/m2", "o4": "104 A/m2" },
  {"ans":"o1","qid":"ce-pyq-68","tag":"NEET(UG) 2022","fig":"database/figures/current-electricity/cepyq68.png", "question": "A wheatstone bridge is used to determine the value of unknown resistance X by adjusting the variable resistance Y as shown in the figure. For the most precise measurement of X, the resistances P and Q:", "o1": "should be approximately equal and are small", "o2": "should be very large and unequal", "o3": "do not play any significant role", "o4": "should be approximately equal to 2X" },
  {"ans":"o4","qid":"ce-pyq-69","tag":"NEET(UG) 2022","fig":"database/figures/current-electricity/cepyq69.png", "question": "A network of resistors is connected across a 10 V battery with internal resistance of 1 Ω as shown in the circuit diagram. The equivalent resistance of the circuit is:", "o1": "14/3 Ω", "o2": "12/7 Ω", "o3": "14/7 Ω", "o4": "17/3 Ω" },
  {"ans":"o4","qid":"ce-pyq-70","tag":"NEET(UG) 2022","fig":null, "question": "The plot of current I flowing through a conductor versus the applied voltage V across the ends of a conductor is:", "o1": "linear with a positive slope", "o2": "linear with a negative slope", "o3": "parabolic with a positive curve", "o4": "parabolic with a negative curve" },
  {"ans":"o3","qid":"ce-pyq-71","tag":"NEET(UG) 2022","fig":null, "question": "The value of resistance for the colour code of the given resistor is: Orange Yellow Blue Gold", "o1": "(470 ± 47) kΩ", "o2": "(360 ± 36) kΩ", "o3": "(360 ± 18) kΩ", "o4": "(36 ± 36) kΩ" },
  {"ans":"o2","qid":"ce-pyq-72","tag":"NEET(UG) 2022","fig":"database/figures/current-electricity/cepyq72.png", "question": "In a metre bridge experiment, the null point is at a distance of 30 cm from A. If a resistance of 16Ω is connected in parallel with resistance Y, the null point occurs at 50 cm from A. The value of the resistance Y is:", "o1": "40/3 Ω", "o2": "64/3 Ω", "o3": "48/3 Ω", "o4": "112/3 Ω" },
  {"ans":"o1","qid":"ce-pyq-73","tag":"NEET(UG) 2022","fig":null, "question": "A cell of emf 4 V and internal resistance 0.5 Ω is connected to a 7.5 Ω external resistance. The terminal potential difference of the cell is:", "o1": "3.75 V", "o2": "4.25 V", "o3": "4 V", "o4": "0.375 V" },
  {"ans":"o3","qid":"ce-pyq-74","tag":"NEET(UG) 2022","fig":"database/figures/current-electricity/cepyq74.png", "question": "The equivalent resistance of the infinite network given below is:", "o1": "2 Ω", "o2": "1 Ω", "o3": "1/3 Ω", "o4": "3 Ω" },
  {"ans":"o4","qid":"ce-pyq-75","tag":"NEET(UG) 2022","fig":null, "question": "The reciprocal of resistance is:", "o1": "reactance", "o2": "mobility", "o3": "conductivity", "o4": "conductance" },
  {"ans":"o1","qid":"ce-pyq-76","tag":"NEET(UG) 2022","fig":"database/figures/current-electricity/cepyq76.png", "question": "The sliding contact C is at one fourth of the length of the potentiometer wire (AB) from A as shown in the circuit diagram. If the resistance of the wire AB is R0, then the potential drop (V) across the resistor R is:", "o1": "V = 1/4", "o2": "V = 3/4", "o3": "V = 1/2", "o4": "V = 1/16" },


  {"fig":null,"ans":"o1","qid":"ce-elp1-1","question":"A flow of 10^7 electrons per second in a conducting wire constitutes a current of","o1":"1.6 × 10^-7 A","o2":"1.6 × 10^-12 A","o3":"1.6 × 10^-19 A","o4":"1.6 × 10^-10 A"},
  {"fig":null,"ans":"o1","qid":"ce-elp1-2","question":"10,000 alpha particles pass per minute through a straight tube of radius r. What is the resulting electric current?","o1":"0.5 × 10^-16","o2":"0.5 × 10^-15","o3":"0.5 × 10^-17","o4":"None of these"},
  {"fig":null,"ans":"o3","qid":"ce-elp1-3","question":"In neon gas discharge tube 2.9 × 10^18 Ne^+ ions move to the right through a cross-section of the tube each second, while 1.2 × 10^18 electrons move to the left in this time. The electronic charges is 1.6 × 10^-19 coulomb. What is the net electric current in the tube?","o1":"0.02 A","o2":"0.66 A","o3":"0.8 A","o4":"1 A"},
  {"fig":null,"ans":"o4","qid":"ce-elp1-4","question":"Charge through a cross-section of a conductor is given by Q = (2t^2 + 5t)c. Find the current through the conductor at the instant t = 2 s.","o1":"2 A","o2":"4 A","o3":"13 A","o4":"1 A"},
  {"fig":null,"ans":"o4","qid":"ce-elp1-5","question":"The current i through a wire varies with time t as shown. How many coulomb charge flows through the wire in time interval t_1 = 0 to t_2 = 3 second:","o1":"13.5 C","o2":"27 C","o3":"37.5 C","o4":"54 C"},
  {"fig":null,"ans":"o2","qid":"ce-elp1-6","question":"The current i through a conductor varies with time t as shown in figure. The average electric current during t = 0 to t = 10 s will be","o1":"5.6 A","o2":"4 A","o3":"4.8 A","o4":"8 A"},
  {"fig":null,"ans":"o4","qid":"ce-elp1-7","question":"If current through a cross-section varies with time as i = (a + bt) where a and b are constant, then average current through the cross-section in time t_1 = 0 to t_2 = t see is:","o1":"a + be","o2":"(a + b)","o3":"(a + b)/2","o4":"a + b"},
  {"fig":null,"ans":"o4","qid":"ce-elp1-8","question":"Find the number of free electrons per unit volume in a conductor, whose density is \\(10^4 \\, \\text{kg/m}^3\\). Atomic mass number is 100 and every atom contribute one free electron:","o1":"6.023 \\times 10^{3} \\, \\text{m}^{-3}","o2":"6.023 \\times 10^{18} \\, \\text{m}^{-3}","o3":"6.023 \\times 10^{23} \\, \\text{m}^{-3}","o4":"6.023 \\times 10^{28} \\, \\text{m}^{-3}"},
  {"fig":null,"ans":"o2","qid":"ce-elp1-9","question":"The order of thermal speed of free electrons in the conductors, at room temperature is:","o1":"10^1 \\, \\text{m/s}","o2":"10^7 \\, \\text{m/s}","o3":"10^5 \\, \\text{m/s}","o4":"10^3 \\, \\text{m/s}"},
  {"fig":null,"ans":"o2","qid":"ce-elp1-10","question":"A current of 10A is flowing through a conductor as shown. The current density, is:","o1":"5 \\times 10^4 \\, \\text{A/m}^2","o2":"5\\sqrt{2} \\times 10^4 \\, \\text{A/m}^2","o3":"\\sqrt{2} \\times 10^4 \\, \\text{A/m}^2","o4":"2 \\times 10^4 \\, \\text{A/m}^2"},
  {"fig":null,"ans":"o1","qid":"ce-elp1-11","question":"The diameter of a copper wire is 2 mm, a steady current of 6.25 A is generated by 8.5 \\times 10^{28} \\, \\text{m}^{-3}\\) electrons flowing through it. Calculate the drift velocity of conduction electrons.","o1":"0.15 \\, \\text{mm/s}","o2":"0.2 \\, \\text{mm/s}","o3":"0.25 \\, \\text{mm/s}","o4":"0.3 \\, \\text{m/s}"},
  {"fig":null,"ans":"o1","qid":"ce-elp1-12","question":"A potential difference \\(V\\) exists between the ends of a metal wire of length \\(l\\). The drift velocity will be doubled if:","o1":"\\(V\\) is doubled","o2":"\\(l\\) is doubled","o3":"The diameter of the wire is doubled","o4":"The temperature of the wire is doubled"},
  {"fig":null,"ans":"o4","qid":"ce-elp1-13","question":"A current \\(I\\) flows through a uniform wire of diameter \\(d\\) when the mean electron drift velocity is \\(v\\). The same current will flow through a wire of diameter \\(d/2\\) made of the same material if the mean drift velocity of the electron is:","o1":"\\(v/4\\)","o2":"\\(v/2\\)","o3":"\\(2v\\)","o4":"\\(4v\\)"},
  {"fig":null,"ans":"o2","qid":"ce-elp1-14","question":"A charged particle having drift velocity of \\(7.5 \\times 10^{-4} \\, \\text{m s}^{-1}\\) in an electric field of \\(3 \\times 10^{-10} \\, \\text{V m}^{-1}\\), has a mobility in \\(\\text{m}^2 \\, \\text{V}^{-1} \\, \\text{s}^{-1}\\) of:","o1":"2.25 \\times 10^6","o2":"2.5 \\times 10^6","o3":"2.5","o4":"2.25 ✕ 10 -15"},
  {"fig":null,"ans":"o4","qid":"ce-elp1-15","question":"A copper conductor of increasing diameter has been shown in figure. which of the following is not correct:","o1":"Ia = Ib","o2":"Ja > Jb","o3":"Ea > Eb","o4":"Va < Vb"},
  {"fig":null,"ans":"o3","qid":"ce-elp2-1","question":"For non-ohmic conductor, V-i graph is not linear as shown in figure. If resistance at current i₁ and i₂ are R₁ & R₂ respectively then,","o1":"R₁ = R₂","o2":"R₁ > R₂","o3":"R₁ < R₂","o4":"R₁ ≥ R₂"},
  {"fig":null,"ans":"o2","qid":"ce-elp2-2","question":"If current density at cross-sectional area \\( \\vec{A} = (\\hat{i} + 2\\hat{j}) \\text{cm}^2 \\) is \\( \\vec{j} = (2\\hat{j} + 2\\hat{k}) \\text{A/m}^2 \\), then current through the area is:","o1":"4 mA","o2":"0.4 mA","o3":"0.04 mA","o4":"2 mA"},
  {"fig":null,"ans":"o3","qid":"ce-elp2-3","question":"If electric field in a uniform metallic conductor is \\( \\vec{E} \\), number density of conduction electron is n, then current density vector is given by:","o1":"\\( \\vec{j} = -\\frac{ne^2 \\tau}{\\rho} \\vec{E} \\)","o2":"\\( \\vec{j} = -\\frac{ne^2 \\tau}{m} \\vec{E} \\)","o3":"\\( \\vec{j} = \\frac{ne^2 \\tau}{m} \\vec{E} \\)","o4":"\\( \\vec{j} = \\frac{ne}{m e^2} \\vec{E} \\)"},
  {"fig":null,"ans":"o3","qid":"ce-elp2-4","question":"Resistivity of a metallic conductor is given by:","o1":"\\( \\rho = \\frac{me^2}{n \\tau} \\)","o2":"\\( \\rho = \\frac{me^2 \\tau}{n} \\)","o3":"\\( \\rho = \\frac{m}{ne^2 \\tau} \\)","o4":"\\( \\rho = \\frac{m \\tau}{ne^2} \\)"},
  {"fig":null,"ans":"o3","qid":"ce-elp2-5","question":"If n, e, m, τ denotes number density of conduction electrons, charge on electron, mass of electron and average relaxation time respectively, then resistance of a wire of length 'l' and area of cross-section A, is:","o1":"\\( R = \\frac{ne^2 \\tau l}{m A} \\)","o2":"\\( R = \\frac{ne^2 \\tau l}{m \\tau A} \\)","o3":"\\( R = \\frac{m l}{ne^2 \\tau A} \\)","o4":"\\( R = \\frac{me^2 \\tau l}{A} \\)"},
  {"fig":null,"ans":"o2","qid":"ce-elp2-6","question":"Which of the following represents ohm's law:","o1":"\\( \\vec{j} = \\rho \\vec{E} \\)","o2":"\\( \\vec{j} = \\sigma \\vec{E} \\)","o3":"\\( \\vec{j} = \\frac{eE}{\\tau} \\)","o4":"All of these"},
  {"fig":null,"ans":"o2","qid":"ce-elp2-7","question":"Consider a rectangular sheet of copper of resistivity ρ, as shown in the figure. The resistance of the sheet between two shaded faces is:","o1":"\\( R = \\rho \\frac{b}{la} \\)","o2":"\\( R = \\rho \\frac{a}{bl} \\)","o3":"\\( R = \\rho \\frac{l}{ab} \\)","o4":"\\( R = \\rho \\frac{l \\times a}{b} \\)"},
  {"fig":null,"ans":"o1","qid":"ce-elp2-8","question":"Three copper wires of lengths and cross-sectional areas are (l, A), (2l, A/2) and (l/2, 2A). Resistance is minimum in:","o1":"wire of cross-sectional area 2A","o2":"wire of cross-sectional area \\(\\frac{A}{2}\\)","o3":"wire of cross-sectional area A","o4":"same in all three cases"},
  {"fig":null,"ans":"o4","qid":"ce-elp2-9","question":"The masses of the wires of copper are in the ratio of 1 : 3 : 5 and their lengths are in the ratio of 5 : 3 : 1. The ratio of their electrical resistance is:","o1":"1 : 3 : 5","o2":"5 : 3 : 1","o3":"1 : 25 : 125","o4":"125 : 15 : 1"},
  {"fig":null,"ans":"o2","qid":"ce-elp2-10","question":"Which of the following graph between current I and voltage V is valid for GaAs:","o1":"[Graph showing a curve starting from (0,0) and increasing non-linearly]","o2":"[Graph showing a curve starting from (0,0) and increasing non-linearly with a peak and then decreasing]","o3":"[Graph showing a straight line starting from (0,0) and increasing linearly]","o4":"[Graph showing a curve starting from (0,0) and increasing non-linearly with a peak and then flattening out]"},
  {"fig":null,"ans":"o2","qid":"ce-elp3-1","question":"The electric resistance of a certain wire of iron is R. If its length and radius are both doubled, then","o1":"The resistance will be doubled and the specific resistance will be halved","o2":"The resistance will be halved and the specific resistance will remain unchanged","o3":"The resistance will be halved and the specific resistance will be doubled","o4":"The resistance and the specific resistance, will both remain unchanged"},
  {"fig":null,"ans":"o4","qid":"ce-elp3-2","question":"A metal wire of length l has resistance R, if half of its length is stretched uniformly such that final length of wire becomes 2l. The new resistance of wire will be?","o1":"2R","o2":"3R","o3":"4R","o4":"5R"},
  {"fig":null,"ans":"o3","qid":"ce-elp3-3","question":"A silver wire is stretched so that its length increases by 0.5%. The percentage change in its resistance is:","o1":"0.25%","o2":"0.5%","o3":"1%","o4":"2%"},
  {"fig":null,"ans":"o4","qid":"ce-elp3-4","question":"A wire of a certain material is stretched slowly by ten percent. Its new resistance and specific resistance become respectively","o1":"both remain the same","o2":"1.1 times, 1.1 times","o3":"1.2 times, 1.1 times","o4":"1.21 times, same"},
  {"fig":null,"ans":"o3","qid":"ce-elp3-5","question":"If a copper wire is stretched to make its cross-sectional radius 0.1% thinner, then what is the percentage increase in its resistance?","o1":"0.1%","o2":"0.2%","o3":"0.4%","o4":"0.05%"},
  {"fig":null,"ans":"o2","qid":"ce-elp3-6","question":"In metallic conductor, resistivity increase with increase in temperature because:","o1":"On increasing temperature 'n' decreases","o2":"On increasing temperature 't' decreases","o3":"On increasing temperature 'm' decreases","o4":"Both (1) and (2)"},
  {"fig":null,"ans":"o2","qid":"ce-elp3-7","question":"Which one of the following graphs, best represent variation of resistivity with absolute temperature, for copper conductor:","o1":"[Graph 1]","o2":"[Graph 2]","o3":"[Graph 3]","o4":"[Graph 4]"},
  {"fig":null,"ans":"o3","qid":"ce-elp3-8","question":"The resistance of wire is 5Ω at 50°C & 6Ω at 100°C. The resistance of the wire at 0°C will be:","o1":"2Ω","o2":"1Ω","o3":"4Ω","o4":"3Ω"},
  {"fig":null,"ans":"o4","qid":"ce-elp3-9","question":"A potential difference of 200V is applied across a resistance. At a temperature of 15°C, the current flowing through resistance is 10A. What will be the mean temperature of resistance, when current flowing through it has fallen to 5A {given α = 1/234 °C⁻¹ at 0°C}","o1":"254°C","o2":"256°C","o3":"258°C","o4":"264°C"},
  {"fig":null,"ans":"o2","qid":"ce-elp3-10","question":"The current in a metallic conductor is plotted against voltage at two different temperatures T₁ and T₂. Which is correct","o1":"T₁ > T₂","o2":"T₁ < T₂","o3":"T₁ = T₂","o4":"none"},
  {"fig":null,"ans":"o1","qid":"ce-elp4-1","question":"R_AB = ?","o1":"R/4","o2":"R/2","o3":"R","o4":"2R"},
  {"fig":null,"ans":"o2","qid":"ce-elp4-2","question":"R_AB = ?","o1":"2R","o2":"4R/3","o3":"2R/3","o4":"4R"},
  {"fig":null,"ans":"o1","qid":"ce-elp4-3","question":"Six equal resistances are connected between points P, Q, and R as shown in the figure. Then, the net resistance will be maximum between","o1":"P and Q","o2":"Q and R","o3":"P and R","o4":"any two points"},
  {"fig":null,"ans":"o3","qid":"ce-elp4-4","question":"Two metal wires of identical dimensions are connected in series. If σ₁ and σ₂ are the conductivities of the metal wires respectively, the effective conductivity of the combination is","o1":"σ₁ + σ₂ / σ₁σ₂","o2":"σ₁σ₂ / σ₁ + σ₂","o3":"2σ₁σ₂ / σ₁ + σ₂","o4":"σ₁ - σ₂ / 2σ₁σ₂"},
  {"fig":null,"ans":"o3","qid":"ce-elp4-5","question":"n equal resistors are first connected in series and then connected in parallel. What is the ratio of the maximum to the minimum resistance?","o1":"n","o2":"1/n²","o3":"n²","o4":"1/n"},
  {"fig":null,"ans":"o4","qid":"ce-elp4-6","question":"In the diagram resistance between any two junctions is R. Equivalent resistance across terminals A and B is","o1":"\\(\\frac{11R}{7}\\)","o2":"\\(\\frac{18R}{11}\\)","o3":"\\(\\frac{7R}{11}\\)","o4":"\\(\\frac{11R}{18}\\)"},
  {"fig":null,"ans":"o2","qid":"ce-elp4-7","question":"For following circuit, what is the value of total resistance between X and Y?","o1":"\\(R\\)","o2":"\\(2R\\)","o3":"\\(3R\\)","o4":"\\(4R\\)"},
  {"fig":null,"ans":"o1","qid":"ce-elp4-8","question":"What will be the equivalent resistance between the two points A and D?","o1":"\\(30 \\Omega\\)","o2":"\\(40 \\Omega\\)","o3":"\\(20 \\Omega\\)","o4":"\\(10 \\Omega\\)"},
  {"fig":null,"ans":"o4","qid":"ce-elp4-9","question":"Three resistances each of \\(R = 4 \\Omega\\) are connected to form a triangle. The resistance between any two terminals is","o1":"\\(12 \\Omega\\)","o2":"\\(2 \\Omega\\)","o3":"\\(6 \\Omega\\)","o4":"\\(\\frac{8}{3} \\Omega\\)"},
  {"fig":null,"ans":"o2","qid":"ce-elp5-1","question":"The equivalent resistance across AB is:","o1":"0.5 Ω","o2":"1 Ω","o3":"3 Ω","o4":"8 Ω"},
  {"fig":null,"ans":"o3","qid":"ce-elp5-2","question":"The equivalent resistance across AB is:","o1":"R","o2":"\\(\\frac{2R}{3}\\)","o3":"\\(\\frac{3R}{2}\\)","o4":"\\(\\frac{R}{3}\\)"},
  {"fig":null,"ans":"o4","qid":"ce-elp5-3","question":"Calculate the equivalent resistance between point P and Q:","o1":"R","o2":"\\(\\frac{2R}{3}\\)","o3":"\\(\\frac{3R}{2}\\)","o4":"\\(\\frac{R}{3}\\)"},
  {"fig":null,"ans":"o1","qid":"ce-elp5-4","question":"When a wire of uniform cross-section a, length l and resistance R is bent into a complete circle, resistance between any two diametrically opposite points will be:","o1":"\\(\\frac{R}{4}\\)","o2":"4R","o3":"\\(\\frac{R}{8}\\)","o4":"\\(\\frac{R}{2}\\)"},
  {"fig":null,"ans":"o4","qid":"ce-elp5-5","question":"A wire of resistance 12 ohms per meter is bent to form a complete circle of radius 10 cm. The resistance between its two diametrically opposite points, A and B as shown in the figure is:","o1":"3 Ω","o2":"6π Ω","o3":"6 Ω","o4":"0.6π Ω"},
  {"fig":null,"ans":"o3","qid":"ce-elp5-6","question":"The figure shows an infinite circuit formed by the repetition of the same link, consisting of resistance R₁ = 4.0 Ω and R₂ = 3.0 Ω. Find the resistance of this circuit between points A and B.","o1":"3 Ω","o2":"4 Ω","o3":"6 Ω","o4":"7 Ω"},
  {"fig":null,"ans":"o1","qid":"ce-elp5-7","question":"Find the equivalent resistance between A and B of the network extending off to the infinity shown in the figure for R₁ = 1Ω, R₂ = 4Ω:","o1":"4 Ω","o2":"1 Ω","o3":"2 Ω","o4":"8 Ω"},
  {"fig":null,"ans":"o4","qid":"ce-elp5-8","question":"In the network shown in figure each resistance is 1Ω. The effective resistance between A and B is:","o1":"4/3 Ω","o2":"3/2 Ω","o3":"7 Ω","o4":"8/7 Ω"},
  {"fig":null,"ans":"o2","qid":"ce-elp5-9","question":"The equivalent resistance between the points P and Q in the network given here is equal to (given r = 3/2 Ω):","o1":"1/2 Ω","o2":"1 Ω","o3":"3/2 Ω","o4":"2 Ω"},
  {"fig":null,"ans":"o4","qid":"ce-elp5-10","question":"In the network shown, each resistance is R. Calculate the equivalent resistance between A and B.","o1":"4R","o2":"\\( \\frac{R}{5} \\)","o3":"\\( \\frac{5R}{4} \\)","o4":"\\( \\frac{4R}{5} \\)"},
  {"fig":null,"ans":"o3","qid":"ce-elp6-1","question":"In the situation shown, the currents through 3Ω and 2Ω resistances are in the ratio","o1":"3 : 2","o2":"7 : 4","o3":"4 : 3","o4":"3 : 1"},
  {"fig":null,"ans":"o4","qid":"ce-elp6-2","question":"In the arrangement shown, a total current i flows through the circuit. Find the current through 2R.","o1":"zero","o2":"i","o3":"i/3","o4":"2i/3"},
  {"fig":null,"ans":"o4","qid":"ce-elp6-3","question":"The current in the given circuit is","o1":"4.0 A","o2":"6.8 A","o3":"8.3 A","o4":"2.0 A"},
  {"fig":null,"ans":"o2","qid":"ce-elp6-4","question":"Reading of ammeter in the circuit below is:","o1":"16 A","o2":"3 A","o3":"4 A","o4":"12 A"},
  {"fig":null,"ans":"o3","qid":"ce-elp6-5","question":"Current through 3 Ω resistor is 0.8 ampere, then potential drop through 4 Ω resistor is:","o1":"9.6 V","o2":"2.6 V","o3":"4.8 V","o4":"1.2 V"},
  {"fig":null,"ans":"o2","qid":"ce-elp6-6","question":"Electric current through the battery is:","o1":"2 A","o2":"4 A","o3":"6 A","o4":"8 A"},
  {"fig":null,"ans":"o2","qid":"ce-elp6-7","question":"In the circuit shown in figure reading of voltmeter is V₁ when only S₁ is closed, reading of voltmeter is V₂ when only S₂ is closed and reading of voltmeter is V₃ when both S₁ and S₂ are closed. Then:","o1":"V₃ > V₂ > V₁","o2":"V₂ > V₁ > V₃","o3":"V₃ > V₁ > V₂","o4":"V₁ > V₂ > V₃"},
  {"fig":null,"ans":"o2","qid":"ce-elp6-8","question":"In the given circuit, the voltmeter and the electric cell are ideal. Find the reading of the voltmeter (in volts):","o1":"2 V","o2":"1 V","o3":"1.5 V","o4":"0.5 V"},
  {"fig":null,"ans":"o4","qid":"ce-elp6-9","question":"In the circuits shown below, the readings of the voltmeters and the ammeters will be:","o1":"V2 > V1 and i2 > i1","o2":"V2 > V1 and i1 = i2","o3":"V1 = V2 and i1 > i2","o4":"V1 = V2 and i1 = i2"},
  {"fig":null,"ans":"o3","qid":"ce-elp6-10","question":"You are given several identical resistances each of value R = 10Ω and each capable of carrying a maximum current of one ampere. It is required to make a suitable combination of these resistances of 5Ω which can carry a current of 4 ampere. The minimum number of resistances of the type R that will be required for this job is:","o1":"4","o2":"10","o3":"8","o4":"20"},
  {"fig":null,"ans":"o4","qid":"ce-elp7-1","question":"Consider the following two statements.\n(a) Kirchhoff's junction law follows from the conservation of charge.\n(b) Kirchhoff's loop law follows from the conservation of energy.\nWhich of the following is correct?","o1":"Both (a) and (b) are wrong.","o2":"(a) is correct and (b) is wrong.","o3":"(a) is wrong and (b) is correct.","o4":"Both (a) and (b) are correct."},
  {"fig":null,"ans":"o4","qid":"ce-elp7-2","question":"What is the value of current I in the following circuit?","o1":"4 A","o2":"3 A","o3":"2 A","o4":"1 A"},
  {"fig":null,"ans":"o2","qid":"ce-elp7-3","question":"In the given circuit, calculate the potential difference between the points P and Q.","o1":"4 A","o2":"3 A","o3":"2 A","o4":"1 A"},
  {"fig":null,"ans":"o2","qid":"ce-elp7-4","question":"For the circuit shown in the figure, the current I will be","o1":"0.75 V","o2":"1 A","o3":"1.5 A","o4":"0.5 A"},
  {"fig":null,"ans":"o1","qid":"ce-elp7-5","question":"Four cells each of emf E and internal resistance r are connected in series to form a loop ABCD. Find potential difference across AB.","o1":"0 V","o2":"2 A","o3":"4 A","o4":"6 A"},
  {"fig":null,"ans":"o1","qid":"ce-elp7-6","question":"The figure shows part of a certain circuit, find: Potential difference \\( V_C - V_B \\)","o1":"6 V","o2":"10 V","o3":"4 V","o4":"8 V"},
  {"fig":null,"ans":"o3","qid":"ce-elp7-7","question":"Calculate the potential difference between point G and H:","o1":"3 V","o2":"5 A","o3":"7 A","o4":"9 A"},
  {"fig":null,"ans":"o3","qid":"ce-elp7-8","question":"Calculate the potential difference between point a and b:","o1":"1 V","o2":"2 A","o3":"2.4 A","o4":"4.2 A"},
  {"fig":null,"ans":"o4","qid":"ce-elp7-9","question":"The potential difference \\( V_A - V_B \\) between the points A and B in the given figure is:","o1":"-3 V","o2":"+3 V","o3":"+6 V","o4":"+9 V"},
  {"fig":null,"ans":"o4","qid":"ce-elp7-10","question":"The value of R in the circuit should be:","o1":"1 Ω","o2":"1.5 Ω","o3":"2 Ω","o4":"2.5 Ω"},
  {"fig":null,"ans":"o3","qid":"ce-elp7-11","question":"Potential of the point B in the circuit below is:","o1":"5 V","o2":"6 V","o3":"7 V","o4":"8 V"},
  {"fig":null,"ans":"o2","qid":"ce-elp7-12","question":"In the circuit shown the cells A and B have negligible resistances. For V_A = 12 V, R_1 = 500 Ω and R = 100 Ω the galvanometer (G) shows no deflection. The value of V_B is:","o1":"4 V","o2":"2 V","o3":"12 V","o4":"6 V"},
  {"fig":null,"ans":"o1","qid":"ce-elp7-13","question":"As the switch S is closed in the circuit shown in figure, current passed through it is:","o1":"4.5 A","o2":"6.0 A","o3":"3.0 A","o4":"Zero"},
  {"fig":null,"ans":"o1","qid":"ce-elp7-14","question":"Find the potential difference between points a and b.","o1":"1 V","o2":"2 A","o3":"3 A","o4":"4 A"},
  {"fig":null,"ans":"o4","qid":"ce-elp7-15","question":"The reading of an ideal voltmeter in the circuit shown is:","o1":"0.6 V","o2":"0 V","o3":"0.5 V","o4":"0.4 V"},
  {"fig":null,"ans":"o4","qid":"ce-elp8-1","question":"The internal resistance of a 2.1 V cell which gives a current of 0.2 A through a resistance of 10 Ω is:","o1":"0.8 Ω","o2":"10 Ω","o3":"0.2 Ω","o4":"0.5 Ω"},
  {"fig":null,"ans":"o1","qid":"ce-elp8-2","question":"The internal resistance of a cell of e.m.f. 2 V is 0.1 Ω. It is connected to a resistance of 3.9 Ω. The voltage across the cell will be:","o1":"1.95 V","o2":"1.9 V","o3":"0.5 V","o4":"2 V"},
  {"fig":null,"ans":"o3","qid":"ce-elp8-3","question":"A car battery of emf 12 V and internal resistance 5 × 10⁻² Ω, receives a current of 60 amp from external source, then terminal potential difference of battery is:","o1":"12 V","o2":"9 V","o3":"15 V","o4":"20 V"},
  {"fig":null,"ans":"o2","qid":"ce-elp8-4","question":"A current of 2 A flows through a 2 Ω resistor when connected across a battery. The same battery supplies a current of 0.5 A when connected across a 9 Ω resistor. The internal resistance of the battery is:","o1":"0.5 Ω","o2":"1/3 Ω","o3":"1/4 Ω","o4":"1 Ω"},
  {"fig":null,"ans":"o1","qid":"ce-elp8-5","question":"A student measures the terminal potential difference (V) of a cell (of emf ε and internal resistance r) as a function of the current (I) flowing through it. The slope, and intercept, of the graph between V and I, then, respectively, equal:","o1":"–r and ε","o2":"r and –ε","o3":"–ε and r","o4":"ε and –r"},
  {"fig":null,"ans":"o2","qid":"ce-elp8-6","question":"Two batteries of different e.m.f.'s and internal resistance are connected in series with each other and with an external load resistor. The current is 3.0 A. When the polarity of one battery is reversed, the current becomes 10.0 A. The ratio of the e.m.f.'s of the two batteries is:","o1":"2.5","o2":"2","o3":"1.5","o4":"1"},
  {"fig":null,"ans":"o4","qid":"ce-elp8-7","question":"n identical cells are joined in series with its two cells A and B in the loop with reversed polarities. EMF of each cell is E and internal resistance r. Potential difference across cell A or B is (here n > 4):","o1":"2E/n","o2":"2E(1 - 1/n)","o3":"4E/n","o4":"2E(1 - 2/n)"},
  {"fig":null,"ans":"o1","qid":"ce-elp8-8","question":"A set of n equal resistors, of value R each, are connected in series to a battery of emf E and internal resistance R. The current drawn is I. Now, the n resistors are connected in parallel to the same battery Then the current drawn from battery becomes 10I. The value of n is:","o1":"10","o2":"11","o3":"20","o4":"9"},
  {"fig":null,"ans":"o4","qid":"ce-elp8-9","question":"A cell having an emf e and internal resistance r is connected across a variable external resistance R. As the resistance R is increased, the plot of potential difference V across R is given by","o1":"Graph 1","o2":"Graph 2","o3":"Graph 3","o4":"Graph 4"},
  {"fig":null,"ans":"o1","qid":"ce-elp8-10","question":"Ten identical cells connected in series are needed to heat a wire of length one meter and radius 'r' by 10°C in time 't'. How many cells will be required to heat the wire of length two meter of the same radius by the same temperature in time 't/2'?","o1":"20","o2":"30","o3":"40","o4":"10"},
  {"fig":null,"ans":"o1","qid":"ce-elp8-11","question":"A battery consists of a variable number n of identical cells having internal resistance connected in series. The terminals of the battery are short-circuited and the current I measured. Which one of the graph below shows the relationship between I and n?","o1":"Graph 1","o2":"Graph 2","o3":"Graph 3","o4":"Graph 4"},
  {"fig":null,"ans":"o2","qid":"ce-elp8-12","question":"Two cells, having the same e.m.f. are connected in series through an external resistance R. Cells have internal resistances r₁ and r₂ (r₁ > r₂) respectively. When the circuit is closed, the potential difference across the first cell is zero. The value of R is","o1":"r₁ + r₂","o2":"r₁ - r₂","o3":"(r₁ + r₂) / 2","o4":"(r₁ - r₂) / 2"},
  {"fig":null,"ans":"o4","qid":"ce-elp9-1","question":"An electric bulb is rated 60 W, 220 V. The resistance of its filament is","o1":"870 Ω","o2":"780 Ω","o3":"708 Ω","o4":"807 Ω"},
  {"fig":null,"ans":"o2","qid":"ce-elp9-2","question":"Two bulbs are of (40 W, 200 V), and (100 W, 200 V). Then correct relation for their resistances is","o1":"R40 < R100","o2":"R40 > R100","o3":"R40 = R100","o4":"no relation can be predicted."},
  {"fig":null,"ans":"o3","qid":"ce-elp9-3","question":"A (100 W, 200 V) bulb is connected to a 160 volts supply. The power consumption would be","o1":"100 W","o2":"125 W","o3":"64 W","o4":"80 W"},
  {"fig":null,"ans":"o3","qid":"ce-elp9-4","question":"In India electricity is supplied for domestic use at 220 V. It is supplied at 110 V in USA. If the resistance of a 60 W bulb for use in India is R, the resistance of a 60 W bulb for use in USA will be","o1":"R","o2":"2R","o3":"R/4","o4":"R/2"},
  {"fig":null,"ans":"o4","qid":"ce-elp9-5","question":"If two bulbs, whose resistances are in the ratio of 1 : 2 are connected in series, the power dissipated in them has the ratio of","o1":"2 : 1","o2":"1 : 4","o3":"1 : 1","o4":"1 : 2"},
  {"fig":null,"ans":"o4","qid":"ce-elp9-6","question":"When three identical bulbs of 60 watt, 200 volt rating are connected in series to a 200 volt supply, the power drawn by them will be","o1":"60 watt","o2":"180 watt","o3":"10 watt","o4":"20 watt"},
  {"fig":null,"ans":"o4","qid":"ce-elp9-7","question":"Two 220 volt, 100 watt bulbs are connected first in series and then in parallel. Each time the combination is connected to a 220 volt a.c. supply line. The power drawn by the combination in each case respectively will be","o1":"50 watt, 100 watt","o2":"100 watt, 50 watt","o3":"200 watt, 150 watt","o4":"50 watt, 200 watt"},
  {"fig":null,"ans":"o3","qid":"ce-elp9-8","question":"If voltage across a bulb rated 220 volt-100 watt drops by 2.5% of its rated value, the percentage of the rated value by which the power would decrease is","o1":"20%","o2":"2.5%","o3":"5%","o4":"10%"},
  {"fig":null,"ans":"o2","qid":"ce-elp9-9","question":"40 electric bulbs are connected in series across a 220 V supply. After one bulb is fused the remaining 39 are connected again in series across the same supply. The illumination will be","o1":"more with 40 bulbs than with 39","o2":"more with 39 bulbs than with 40","o3":"equal in both the cases","o4":"in the ratio 40² : 39²"},
  {"fig":null,"ans":"o2","qid":"ce-elp9-10","question":"Two cities are 150 km apart. Electric power is sent from one city to another city through copper wires. The fall of potential per km is 8 volt and the average resistance per km is 0.5Ω. The power loss in the wire is:","o1":"19.2 W","o2":"19.2 kW","o3":"19.2 J","o4":"12.2 kW"},
  {"fig":null,"ans":"o2","qid":"ce-elp9-11","question":"A heating coil is labelled 100 W, 220 V. The coil is cut in half and the two pieces are joined in parallel to the same source. The energy now liberated per second is:","o1":"200 W","o2":"400 W","o3":"25 W","o4":"50 W"},
  {"fig":null,"ans":"o4","qid":"ce-elp9-12","question":"N identical bulbs are rated P watt and V volt. When they are connected in series, total power consumed is 20 watt and when connected in parallel they consume total power of 2000 watt. How many bulbs are used:","o1":"200 bulbs","o2":"100 bulbs","o3":"20 bulbs","o4":"10 bulbs"},
  {"fig":null,"ans":"o1","qid":"ce-elp9-13","question":"Power dissipated across the 8 Ω resistor in the circuit shown here is 2 watt. The power dissipated in watt units across the 3 Ω resistor is:","o1":"3.0","o2":"2.0","o3":"1.0","o4":"0.5"},
  {"fig":null,"ans":"o2","qid":"ce-elp9-14","question":"Three identical resistors R₁ = R₂ = R₃ are connected as shown to a battery of constant e.m.f. The power dissipated is:","o1":"The least in R₁","o2":"Greatest in R₁","o3":"In the ratio 1 : 2 resistance R₁ and R₃ respectively","o4":"The same in R₁ and in the parallel combination of R₂ and R₃"},
  {"fig":null,"ans":"o3","qid":"ce-elp9-15","question":"The power dissipated in the circuit shown in the figure is 30 watts. The value of R is:","o1":"20 Ω","o2":"15 Ω","o3":"10 Ω","o4":"30 Ω"},
  {"fig":null,"ans":"o1","qid":"ce-elp9-16","question":"A battery of e.m.f 10 V and internal resistance 0.5 Ω is connected across a variable resistance R. The value of R for which the power delivered in it is maximum is given by","o1":"0.5 Ω","o2":"1.0 Ω","o3":"2.0 Ω","o4":"0.25 Ω"},
  {"fig":null,"ans":"o2","qid":"ce-elp9-17","question":"Two identical batteries each of e.m.f 2 V and internal resistance 1 Ω are available to produce heat in an external resistance by passing a current through it. The maximum power that can be developed across R using these batteries is","o1":"3.2 W","o2":"2.0 W","o3":"1.28 W","o4":"\\(\\frac{8}{9}\\) W"},
  {"fig":null,"ans":"o2","qid":"ce-elp9-18","question":"A battery of internal resistance 4Ω is connected to the network of resistance as shown. In order that the maximum power can be delivered to the network, the value of R in Ω should be:","o1":"\\(\\frac{4}{9}\\)","o2":"2","o3":"8","o4":"18"},
  {"fig":null,"ans":"o1","qid":"ce-elp9-19","question":"Which of the following acts as a circuit protection device?","o1":"Fuse","o2":"Conductor","o3":"Inductor","o4":"Switch"},
  {"fig":null,"ans":"o4","qid":"ce-elp9-20","question":"A 5 ampere fuse wire can withstand a maximum power of 1 watt in the circuit. The resistance of the fuse wire is:","o1":"0.2 Ω","o2":"5 Ω","o3":"0.04 Ω","o4":"0.04 Ω"},
  {"fig":null,"ans":"o2","qid":"ce-elp10-1","question":"Of the two bulbs in a household circuit, one glows brighter than the other, which of the two bulbs has a large resistance?","o1":"The bright bulb","o2":"The dim bulb","o3":"Both have the same resistance","o4":"The brightness does not depend upon the resistance"},
  {"fig":null,"ans":"o1","qid":"ce-elp10-2","question":"Two electric bulbs whose resistance are in the ratio of 1 : 2, are connected in series to a constant voltage source. The power dissipated in them has the ratio:-","o1":"1 : 2","o2":"1 : 1","o3":"1 : 4","o4":"2 : 1"},
  {"fig":null,"ans":"o1","qid":"ce-elp10-3","question":"If two bulbs of wattage 60 W and 100 W respectively each rated at 110 V are connected in series with the supply of 220 V, which bulb will fuse?","o1":"60 W bulb","o2":"100 W bulb","o3":"Both the bulbs","o4":"Bulbs will not fuse"},
  {"fig":null,"ans":"o2","qid":"ce-elp10-4","question":"Two bulbs whose resistances are in the ratio 1 : 2 are connected in parallel to a source of constant voltage. What will be the ratio of the power dissipation in these?","o1":"1 : 2","o2":"2 : 1","o3":"1 : 4","o4":"4 : 1"},
  {"fig":null,"ans":"o2","qid":"ce-elp10-5","question":"Three identical bulbs are connected in series as shown. When switch is closed:","o1":"Both bulbs A and B become dimmer","o2":"Both bulbs A and B become brighter","o3":"Brightness of bulbs remains unchanged","o4":"A becomes brighter and B becomes dimmer"},
  {"fig":null,"ans":"o3","qid":"ce-elp10-6","question":"Two identical bulbs are connected in parallel across an ideal source of emf E. The ammeter A and voltmeter V are ideal. If bulb B2 gets fused, then:","o1":"Reading of A will increase but that of V will remain same","o2":"Reading of A will decrease but that of V will increase","o3":"Reading of A will decrease but that of V will remain same","o4":"Reading of A will increase and reading of V will also increase"},
  {"fig":null,"ans":"o2","qid":"ce-elp10-7","question":"A current of 2 A, passing through a conductor produces 80 J of heat in 10 seconds. The resistance of the conductor in ohm is:","o1":"0.5","o2":"2","o3":"4","o4":"20"},
  {"fig":null,"ans":"o4","qid":"ce-elp10-8","question":"Two heater wires of equal length are first connected in series and then in parallel. The ratio of heat produced in the two cases is:","o1":"2 : 1","o2":"1 : 2","o3":"4 : 1","o4":"1 : 4"},
  {"fig":null,"ans":"o1","qid":"ce-elp10-9","question":"An electric kettle has two heating coils. When one of the coils is connected to an a.c. source, the water in the kettle boils in 10 minutes. When the other coil is used the water boils in 40 minutes. If both the coils are connected in parallel, the time taken by the same quantity of water to boil will be:","o1":"8 minutes","o2":"4 minutes","o3":"25 minutes","o4":"15 minutes"},
  {"fig":null,"ans":"o3","qid":"ce-elp10-10","question":"The charge flowing through a resistance R varies with time t as Q = at - bt², where a and b are positive constants. The total heat produced in R is:","o1":"a²R / 2b","o2":"a²R / b","o3":"a²R / 6b","o4":"a²R / 3b"},
  {"fig":null,"ans":"o4","qid":"ce-elp11-1","question":"In the network shown in the figure, each of the resistance is equal to 2 Ω. The resistance between the points A and B is","o1":"3 Ω","o2":"4 Ω","o3":"1 Ω","o4":"2 Ω"},
  {"fig":null,"ans":"o3","qid":"ce-elp11-2","question":"The equivalent resistance between the points A and B is","o1":"\\( \\frac{36}{7} \\) Ω","o2":"10 Ω","o3":"\\( \\frac{85}{7} \\) Ω","o4":"none of these"},
  {"fig":null,"ans":"o4","qid":"ce-elp11-3","question":"For the network shown in the figure the value of the current i is","o1":"\\( \\frac{9V}{35} \\)","o2":"\\( \\frac{18V}{5} \\)","o3":"\\( \\frac{5V}{9} \\)","o4":"\\( \\frac{5V}{18} \\)"},
  {"fig":null,"ans":"o4","qid":"ce-elp11-4","question":"The resistances of the four arms P, Q, R and S in a Wheatstone's bridge are 10 ohm, 30 ohm, 30 ohm and 90 ohm, respectively. The e.m.f. and internal resistance of the cell are 7 volt and 5 ohm respectively. If the galvanometer resistance is 50 ohm, the current drawn from the cell will be","o1":"0.1 A","o2":"0.2 A","o3":"1.0 A","o4":"0.2 A"},
  {"fig":null,"ans":"o1","qid":"ce-elp11-5","question":"Three resistances P, Q, R each of 2 Ω and an unknown resistance S form the four arms of a Wheatstone bridge circuit. When a resistance of 6 Ω is connected in parallel to S the bridge gets balanced. What is the value of S?","o1":"3 Ω","o2":"6 Ω","o3":"1 Ω","o4":"2 Ω"},
  {"fig":null,"ans":"o3","qid":"ce-elp11-6","question":"Calculate the current flowing through the resistance 2Ω.","o1":"2A","o2":"3A","o3":"1A","o4":"4A"},
  {"fig":null,"ans":"o1","qid":"ce-elp11-7","question":"In the circuit shown, if a conducting wire is connected between points A and B, the current in this wire will","o1":"flow from B to A","o2":"flow from A to B","o3":"flow in the direction which will be decided by the value of V","o4":"be zero"},
  {"fig":null,"ans":"o1","qid":"ce-elp11-8","question":"In the circuit shown P ≈ R, the reading of galvanometer is same with switch S open or closed. Then:","o1":"I₁ = I₄","o2":"I₂ = I₄","o3":"I₃ = I₆","o4":"I₉ = Iₖ"},
  {"fig":null,"ans":"o4","qid":"ce-elp11-9","question":"In a metre bridge, the balancing length from the left end (standard resistance of one ohm is in the right gap) is found to be 20 cm. The value of the unknown resistance is","o1":"0.8Ω","o2":"0.5Ω","o3":"0.4Ω","o4":"0.25Ω"},
  {"fig":null,"ans":"o4","qid":"ce-elp11-10","question":"The metre bridge shown is in balance position with \\(\\frac{P}{Q} = \\frac{L_1}{L_2}\\). If we now interchange the positions of galvanometer and cell, will the bridge work? If yes, what will be balanced condition?","o1":"yes, \\(\\frac{P}{Q} = \\frac{L_1 - L}{L_2 + L}\\)","o2":"no, no null point","o3":"yes, \\(\\frac{P}{Q} = \\frac{L}{L_1}\\)","o4":"yes, \\(\\frac{P}{Q} = \\frac{L}{L_2}\\)"},
  {"fig":null,"ans":"o2","qid":"ce-elp11-11","question":"The resistances in the two arms of the metre bridge are \\(5 \\Omega\\) and \\(R \\Omega\\) respectively. When the resistance \\(R\\) is shunted with an equal resistance, the new balance point is at \\(1.6 L_1\\). The resistance \\(R\\) is","o1":"\\(10 \\Omega\\)","o2":"\\(15 \\Omega\\)","o3":"\\(20 \\Omega\\)","o4":"\\(25 \\Omega\\)"},
  {"fig":null,"ans":"o4","qid":"ce-elp11-12","question":"Circuit diagram of metre bridge is shown in figure. The null point is found at a distance of 40 cm from A. If now a resistance of \\(12 \\Omega\\) is connected in parallel with \\(S\\), the null point shifts to 64 cm. Determine the values of \\(R\\) and \\(S\\).","o1":"\\(10/3 \\Omega, 4 \\Omega\\)","o2":"\\(10 \\Omega, 5/3 \\Omega\\)","o3":"\\(30 \\Omega, 1.5 \\Omega\\)","o4":"\\(40/3 \\Omega, 20 \\Omega\\)"},
  {"fig":null,"ans":"o2","qid":"ce-elp11-13","question":"A resistance wire connected in the left gap of a metre bridge balances a \\(10 \\Omega\\) resistance in the right gap at a point which divides the bridge wire in the ratio 3 : 2. If the length of the resistance wire is 1.5 m, then the length of \\(1 \\Omega\\) of the resistance wire is","o1":"\\(1.0 \\times 10^{-2} m\\)","o2":"\\(1.0 \\times 10^{-1} m\\)","o3":"\\(1.5 \\times 10^{-1} m\\)","o4":"\\(1.5 \\times 10^{-2} m\\)"},
  {"fig":null,"ans":"o1","qid":"ce-elp11-14","question":"In the figure shown for given values of \\(R_1\\) and \\(R_2\\), the balance point for Jockey is at 40 cm from A. When \\(R_2\\) is shunted by a resistance of \\(10 \\Omega\\), balanced shifts to 50 cm. \\(R_1\\) and \\(R_2\\) are (AB = 1m):","o1":"\\(10/3 \\Omega, 5 \\Omega\\)","o2":"\\(10 \\Omega, 5/3 \\Omega\\)","o3":"\\(30 \\Omega, 1.5 \\Omega\\)","o4":"\\(5 \\Omega, 10 \\Omega\\)"},
  {"fig":null,"ans":"o3","qid":"ce-elp11-15","question":"In the circuit shown, a meter bridge is in its balanced state. The meter bridge wire has a resistance \\(0.1 \\Omega/cm\\). The value of unknown resistance \\(X\\) and the current drawn from the battery of negligible resistance is:","o1":"\\(62.5 \\Omega, 0.2 amp\\)","o2":"\\(102 \\Omega, 0.1 amp\\)","o3":"\\(42 \\Omega, 1.0 amp\\)","o4":"\\(12.5 \\Omega, 0.5 amp\\)"},
  {"fig":null,"ans":"o1","qid":"ce-elp12-1","question":"Reading of the ideal voltmeter in the circuit below is:","o1":"10 V","o2":"8 V","o3":"6 V","o4":"Zero"},
  {"fig":null,"ans":"o1","qid":"ce-elp12-2","question":"Two resistances of 100 Ω and 200 Ω are connected in series with a battery of emf 4 volt and negligible internal resistance. A voltmeter of resistance 200 Ω is used to measure voltage across the two resistance separately. Calculate the voltage indicated when voltmeter connected across 100 Ω:","o1":"1 V","o2":"2 V","o3":"3 V","o4":"4 V"},
  {"fig":null,"ans":"o2","qid":"ce-elp12-3","question":"A voltmeter is connected in parallel with a variable resistance R which is in series with an ammeter and a cell as shown in the figure. For one value of R, the meters read 0.3 A and 0.9 V. For another value of R the reading are 0.25 A and 1.0 V. What is the internal resistance of the cell?","o1":"0.5 Ω","o2":"2 Ω","o3":"1.2 Ω","o4":"1 Ω"},
  {"fig":null,"ans":"o1","qid":"ce-elp12-4","question":"To convert a galvanometer into an ammeter, one needs to connect a","o1":"low resistance in parallel","o2":"high resistance in parallel","o3":"low resistance in series","o4":"high resistance in series"},
  {"fig":null,"ans":"o1","qid":"ce-elp12-5","question":"To convert a galvanometer into a voltmeter one should connect a","o1":"high resistance in series with galvanometer","o2":"low resistance in series with galvanometer","o3":"high resistance in parallel with galvanometer","o4":"low resistance in parallel with galvanometer"},
  {"fig":null,"ans":"o1","qid":"ce-elp12-6","question":"A galvanometer has a coil of resistance 100 ohm and gives a full-scale deflection for 30 mA current. If it is to work as a voltmeter of 30 volt range, the resistance required to be added will be","o1":"900Ω","o2":"1800Ω","o3":"500Ω","o4":"1000Ω"},
  {"fig":null,"ans":"o3","qid":"ce-elp12-7","question":"A galvanometer having a coil of resistance 60 Ω shows full-scale deflection when a current of 1.0 amp passes through it. It can be converted into an ammeter to read currents up to 5.0 amps by","o1":"putting in series a resistance of 15 Ω","o2":"putting in series a resistance of 240 Ω","o3":"putting in parallel a resistance of 15 Ω","o4":"putting in parallel a resistance of 240 Ω"},
  {"fig":null,"ans":"o4","qid":"ce-elp12-8","question":"A galvanometer of 50 ohms resistance has 25 divisions. A current of 4 x 10^-4 amperes gives a deflection of one division. To convert this galvanometer into a voltmeter having a range of 25 volts, it should be connected with a resistance of","o1":"2500 Ω as a shunt","o2":"2450 Ω as a shunt","o3":"2550 Ω in series","o4":"2450 Ω in series"},
  {"fig":null,"ans":"o2","qid":"ce-elp12-9","question":"A galvanometer having a resistance of 9 ohms is shunted by a wire of resistance 2 ohms. If the total current is 1 amp, the part of it passing through the shunt will be","o1":"0.2 amp","o2":"0.8 amp","o3":"0.25 amp","o4":"0.5 amp"},
  {"fig":null,"ans":"o1","qid":"ce-elp12-10","question":"The resistance of an ammeter is 13 Ω and its scale is graduated for a current up to 100 amps. After an additional shunt has been connected to this ammeter it becomes possible to measure currents up to 750 amperes by this meter. The value of shunt resistance is","o1":"2 Ω","o2":"0.2 Ω","o3":"2 kΩ","o4":"20 Ω"},
  {"fig":null,"ans":"o3","qid":"ce-elp12-11","question":"In an ammeter 0.2% of the main current passes through the galvanometer. If the resistance of the galvanometer is G, the resistance of the ammeter will be","o1":"1/499 G","o2":"499/500 G","o3":"1/500 G","o4":"500/499 G"},
  {"fig":null,"ans":"o2","qid":"ce-elp12-12","question":"A galvanometer of resistance 50 Ω is connected to a battery of 3 V along with a resistance of 2950 Ω in series. A full-scale deflection of 30 divisions is obtained in the galvanometer. To reduce this deflection to 20 divisions, the resistance in series should be","o1":"6050 Ω","o2":"4450 Ω","o3":"5050 Ω","o4":"5550 Ω"},
  {"fig":null,"ans":"o4","qid":"ce-elp12-13","question":"A galvanometer of resistance, G, is shunted by a resistance S ohm. To keep the main current in the circuit unchanged, the resistance to be put in series with the galvanometer is","o1":"G/(S + G)","o2":"S^2/(S + G)","o3":"SG/(S + G)","o4":"G^2/(S + G)"},
  {"fig":null,"ans":"o1","qid":"ce-elp12-14","question":"A millivoltmeter of 25 millivolt range is to be converted into an ammeter of 25 ampere range. The value (in ohm) of the necessary shunt will be","o1":"0.001","o2":"0.01","o3":"1","o4":"0.05"}
]
