[
    {"fig":null,"ans":"o2","qid":"mp1-ex1-1","question":"The energy of photon of visible light with maximum wavelength in eV is:","o1":"1","o2":"3.2","o3":"1.6","o4":"7"},
    {"fig":null,"ans":"o1","qid":"mp1-ex1-2","question":"What is the momentum of a photon having frequency 1.5 × 1013 Hz:","o1":"3.3 × 10–29 kg m/s","o2":"3.3 × 10–34 kg m/s","o3":"6.6 × 10–34 kg m/s","o4":"6.6 × 10–30 kg m/s"},
    {"fig":null,"ans":"o2","qid":"mp1-ex1-3","question":"The strength of photoelectric current is directly proportional to:","o1":"Frequency of incident radiation","o2":"Intensity of incident radiation","o3":"Angle of incidence of radiation","o4":"Distance between anode and cathode"},
    {"fig":null,"ans":"o3","qid":"mp1-ex1-4","question":"When light is incident on surface, photo electrons are emitted. For photoelectrons:","o1":"The value of kinetic energy is same for all","o2":"Maximum kinetic energy do not depend on the wave length of incident light","o3":"The value of kinetic energy is equal to or less than a maximum kinetic energy","o4":"None of the above."},
    {"fig":null,"ans":"o4","qid":"mp1-ex1-5","question":"When light falls on a photosensitive surface, electrons are emitted from the surface. The kinetic energy of these electrons does not depend on the:","o1":"Wavelength of light","o2":"Frequency of light","o3":"Type of material used for the surface","o4":"Intensity of light"},
    {"fig":null,"ans":"o3","qid":"mp1-ex1-6","question":"The work- function of a substance is 4.0 eV. The longest wavelength of light that can cause photoelectron emission from this substance is approximately:","o1":"540 nm","o2":"400 nm","o3":"310 nm","o4":"220 nm"},
    {"fig":null,"ans":"o1","qid":"mp1-ex1-7","question":"Photoelectric effect takes place in element A. Its work function is 2.5 eV and threshold wavelength is λ. Another element B is having work function of 5 eV. Then find out the maximum wavelength that can produce photoelectric effect in B:","o1":"λ\/2","o2":"2λ","o3":"λ","o4":"3λ"},
    {"fig":null,"ans":"o2","qid":"mp1-ex1-8","question":"When light of wavelength lesser than 6000 Å is incident on a metal, electrons are emitted. The approximate work-function of the metal is:","o1":"1 eV","o2":"2 eV","o3":"4 eV","o4":"6 eV"},
    {"fig":null,"ans":"o1","qid":"mp1-ex1-9","question":"Surface of sodium is illuminated by a light of 6000 Å wavelength. Work function of sodium is 1.6 eV. Then minimum K.E. of emitted electrons is:","o1":"0 eV","o2":"1.53 eV","o3":"2.46 eV","o4":"4.14 eV"},
    {"fig":null,"ans":"o1","qid":"mp1-ex1-10","question":"The maximum kinetic energy of photoelectrons emitted from a surface when photons of energy 6 eV fall on it is 4 eV. The stopping potential in volt is:","o1":"4","o2":"6","o3":"8"},
    {"fig":null,"ans":"o2","qid":"mp1-ex1-11","question":"When a point source of monochromatic light is at a distance of 0.2 m from a photoelectric cell, the cut - off voltage and the saturation current are 0.6 volt and 18 mA respectively. If the same source is placed 0.6 m away from the photoelectric cell, then:","o1":"The stopping potential will be 0.2 V","o2":"The stopping potential will be 0.6 V","o3":"The saturation current will be 6 mA","o4":"The saturation current will be 18 mA"},
    {"fig":null,"ans":"o2","qid":"mp1-ex1-12","question":"The maximum wavelength of light for photoelectric effect from a metal is 200 nm. The maximum kinetic energy of electron which is emitted by the radiation of wavelength 100 nm will be:","o1":"12.4 eV","o2":"6.2 eV","o3":"100 eV","o4":"200 eV"},
    {"fig":"modern1/mp1-ex1-13.png","ans":"o2","qid":"mp1-ex1-13","question":"The stopping potential as a function of frequency of incident radiation is plotted for two different surfaces A and B. The graphs show that the work function of A is:","o1":"Greater than that of B","o2":"Smaller than that of B","o3":"Same as that of B","o4":"No comparison can be done from given graphs"},
    {"fig":null,"ans":"o2","qid":"mp1-ex1-14","question":"The slope of graph drawn between stopping potential and frequency of incident light for a given surface will be:","o1":"h","o2":"h/e","o3":"eh","o4":"e"},
    {"fig":null,"ans":"o1","qid":"mp1-ex1-15","question":"By photoelectric effect, Einstein proved:","o1":"E = hν","o2":"E = mc²","o3":"KE = -1/2mv²","o4":"E = Rhc/n²"},
    {"fig":null,"ans":"o1","qid":"mp1-ex1-16","question":"Which one among shows particle nature of light:","o1":"P.E.E.","o2":"Interference","o3":"Refraction","o4":"Polarization"},
    {"fig":null,"ans":"o2","qid":"mp1-ex1-17","question":"A photo-cell is illuminated by a source of light, which is placed at a distance d from the cell. If the distance becomes d/2, then number of electrons emitted per second will be:","o1":"Remain same","o2":"Four times","o3":"Two times","o4":"One-fourth"},
    {"fig":"modern1/mp1-ex1-18.png","ans":"o3","qid":"mp1-ex1-18","question":"Graph is plotted between maximum kinetic energy of electron with frequency of incident photon in Photoelectric effect. The slope of curve will be:","o1":"Charge of electron","o2":"Work function of metal","o3":"Planck’s constant","o4":"Ratio of Planck constant and charge of electron"},
    {"fig":null,"ans":"o3","qid":"mp1-ex1-19","question":"Photon of energy 6 eV is incident on a metal surface of work function 4 eV. Maximum KE of emitted photo electrons will be:","o1":"0 eV","o2":"1 eV","o3":"2 eV","o4":"4 eV"},
    {"fig":null,"ans":"o2","qid":"mp1-ex1-20","question":"Light of frequency ν is incident on a metal of threshold frequency ν0. Then work function of metal will be:","o1":"hν","o2":"hν0","o3":"h(ν – ν0)","o4":"h (ν + ν0)"},
    {"fig":null,"ans":"o4","qid":"mp1-ex1-21","question":"The work function of a photoelectric material is 3.3 eV. Its threshold frequency will be:","o1":"4 × 10²³ Hz","o2":"8 × 10¹² Hz","o3":"4 × 10¹¹ Hz","o4":"8 × 10¹⁴ Hz"},
    {"fig":null,"ans":"o2","qid":"mp1-ex1-22","question":"The value of Planck's constant is:","o1":"6.63 × 10–34 J/s","o2":"6.63 × 10–34 kg–m²/s","o3":"6.63 × 10–34 kg–m²","o4":"6.63 × 10–34 J–s–1"},
    {"fig":null,"ans":"o2","qid":"mp1-ex1-23","question":"When ultraviolet rays incident on metal plate then photoelectric effect does not occur, it occurs by incidence of:","o1":"Infrared rays","o2":"X-rays","o3":"Radio wave","o4":"Light wave"},
    {"fig":null,"ans":"o4","qid":"mp1-ex1-24","question":"A photoelectric cell is illuminated by a point source of light 1 m away. When the source is shifted to 2m then:","o1":"each emitted electron carries one quarter of the initial energy","o2":"number of electrons emitted is half the initial number","o3":"each emitted electron carries half the initial energy","o4":"number of electrons emitted is a quarter of the initial number"},
    {"fig":"modern1/mp1-ex1-25.png","ans":"o1","qid":"mp1-ex1-25","question":"The graphs show the variation of current I (y-axis) in two photocell A & B as a function of the applied voltage V(x-axis) when light of same frequency is incident on the cell. Which of the following is the correct conclusion drawn from the data?","o1":"Cathodes of the two cells are made from the same substance, the intensity of light used are different","o2":"Cathodes are made from different substances and the intensity of light is the same","o3":"Cathode substances as well as intensity of light are different","o4":"No conclusion can be drawn"},
    {"fig":null,"ans":"o3","qid":"mp1-ex1-26","question":"According to Einstein's photoelectric equation, the graph between the kinetic energy of photoelectrons ejected and the frequency of incident radiation is:","io1":"modern1/mp1-ex1-26-o1.png","io2":"modern1/mp1-ex1-26-o2.png","io3":"modern1/mp1-ex1-26-o3.png","io4":"modern1/mp1-ex1-26-o4.png"},
    {"fig":null,"ans":"o4","qid":"mp1-ex1-27","question":"According to Einstein's photoelectric equation, the plot of the kinetic energy of the emitted photoelectrons from a metal v/s the frequency of the incident radiation gives a straight line whose slope:","o1":"depends on the intensity of the radiation","o2":"depends of the nature of the metal used","o3":"depends both on the intensity of the radiation and the metal used.","o4":"is the same for all metals and independent of the intensity of the radiation."},
    {"fig":null,"ans":"o1","qid":"mp1-ex1-28","question":"A photon of energy 4 eV is incident on a metal surface whose work function is 2 eV. The minimum reverse potential to be applied for stopping the current is:","o1":"2V","o2":"4V","o3":"6V","o4":"8V"}
]
